[{"link": "https://www.mooc-list.com/initiative/european-schoolnet-academy", "name": "European Schoolnet Academy", "description": "As primary or secondary school teacher, you can benefit from the online professional development courses that we are about to launch in the European Schoolnet Academy to learn about innovation in the school and classroom, and enhance your teaching practice.Through our courses, you can get an introduction to key concepts and ideas that are relevant to developing your teaching practice and have the opportunity to discuss these ideas and share your experiences with other teachers and experts across Europe."}, {"link": "https://www.mooc-list.com/initiative/apnacourse", "name": "ApnaCourse", "description": "ApnaCourse.com is a leading E-Learning Platform providing in-demand video courses delivered by Top Instructors. The courses are aimed at individuals to enhance their skill set and advance their career.Launched in August 2013, ApnaCourse today caters to thousands of individuals the world over with multitudes of courses across domains.ApnaCourse Courses:"}, {"link": "https://www.mooc-list.com/initiative/leada", "name": "Leada", "description": "We started Leada because we believe in data literacy and learning by doing.We are a purposeful team of software engineers, data engineers, and data analysts having worked at companies such as Splunk and Bank of America Merill Lynch. Data driven decisions is what we learned first. Working on our own projects was how we learned. We are on a mission to change the way people learn."}, {"link": "https://www.mooc-list.com/initiative/firstaidforfree", "name": "FirstAidForFree", "description": "First Aid for free. Firstaidforfree.com offers free online first aid courses that anyone can take. Our free online first aid training could equip you with the skills and knowledge to help save someone’s life."}, {"link": "https://www.mooc-list.com/initiative/urjcx", "name": "URJCx", "description": "Cursos abiertos masivos onlinePara cualquier persona, en cualquier lugar, en cualquier momento."}, {"link": "https://www.mooc-list.com/initiative/smartly", "name": "Smartly", "description": "Combining breakthroughs in online learning with traditional MBA course material, Smartly gives you all the benefits with none of the sacrifice."}, {"link": "https://www.mooc-list.com/initiative/upvx", "name": "UPVX", "description": "Cursos masivos online de la UPV, para cualquiera, en cualquier lugar, en cualquier momento."}, {"link": "https://www.mooc-list.com/initiative/other-providers", "name": "Other Providers", "description": "Multiple smaller providers or entities."}, {"link": "https://www.mooc-list.com/initiative/simpliv", "name": "Simpliv", "description": "Online learning platforms such as Simpliv are completely changing the face of the education landscape for better. Among the many advantages of the e-learning platforms, one of the most significant ones is that it allows the learners to access the expertise of the trained instructors and gives the opportunity to become active participants within the eLearning community.More info here."}, {"link": "https://www.mooc-list.com/initiative/cybrary", "name": "Cybrary", "description": "Cybrary.IT is a revolution for the global citizens who believe IT and Cyber Security should be liberated. We provide a free and open source Information Technology (IT) and Cyber Security training environment. We believe in keeping the world’s IT professionals prepared for the ever changing industry and its evolving technologies, as well as providing an excellent source of learning for the people who cannot afford the traditional options. You can learn almost anything IT and cyber security related, for free."}, {"link": "https://www.mooc-list.com/initiative/feedmyhappy", "name": "FeedMyHappy", "description": "FeedMyHappy offers a wide range of online courses designed to help you find out what makes you happy."}, {"link": "https://www.mooc-list.com/initiative/world-mentoring-academy-wma", "name": "World Mentoring Academy (WMA)", "description": "FREE Interactive Learning OpenCourseware from MIT, UC Berkeley, Harvard, Yale, Stanford, U Houston, USC, UCLA, Khan Academy, NPTEL"}, {"link": "https://www.mooc-list.com/initiative/projectmanagers-org", "name": "ProjectManagers .Org", "description": "We provide access to education and learning opportunities for everyone, anytime, anywhere! You get great affordable Certification programs with FREE Online Courses (Massive Open Online Courses, MOOCs). You only pay for the exam."}, {"link": "https://www.mooc-list.com/initiative/box-hill-institute", "name": "Box Hill Institute", "description": "Learn what you want when you want!"}, {"link": "https://www.mooc-list.com/initiative/fx-academy", "name": "FX Academy", "description": "FX Academy is a comprehensive educational system conceived directly from the need for traders to learn about Forex trading at their own pace in a comfortable, interactive environment. Founded by the trading experts at DailyForex.com who have been monitoring and reporting on the Forex market since 2006, FX Academy offers traders of all levels the courses they need to sharpen their trading skills and enhance their knowledge of the world of Forex. In addition to courses about specific technical trading strategies and Forex trading basics, FX Academy also offers a range of lessons dealing with the complexities of trading psychology, which enable traders to better understand their strengths, their weaknesses and themselves.FX Academy is an entirely free service that was built with the understanding that Forex trading requires a mix of collaborative research and independent thinking, and that each trader must find the strategy with which he is most comfortable. To this end, FX Academy provides a range of courses, complete with videos, quizzes and trade simulators to help traders identify their trouble spots and to focus on the different aspects of their Forex trading. FX Academy has developed its own unique Forex Strategy Simulations, a valuable tool created for users to assist them in defining their trading strategies for future trading. Throughout their studies, traders will be tested on the information they've learned so that they can see where they excel and where they need additional instruction. The lessons are constructed in such a way that the deeper a student delves into the material, the more levels he can reach. Each lesson is accompanied by additional reading material and links to related lessons and articles."}, {"link": "https://www.mooc-list.com/initiative/online-university-finland", "name": "Online University of Finland", "description": "Improve your professional skills with high quality online courses from Finland’s top universities."}, {"link": "https://www.mooc-list.com/initiative/open2study", "name": "Open2Study", "description": "Open2Study provides free, specialised short courses, entirely online, across the world, in a range of subject areas."}, {"link": "https://www.mooc-list.com/initiative/opencourseworld", "name": "OpenCourseWorld", "description": "OpenCourseWorld IMC's offer for open, free online courses. Herewith we offer individuals the opportunity for a free and self-organized further training and thus useful to acquire additional qualifications. This is especially interesting for those who would otherwise not have the opportunity for financial, geographical or temporal aspects to take certain training offers."}, {"link": "https://www.mooc-list.com/initiative/mruniversity", "name": "MRUniversity", "description": "Marginal Revolution University (MRUniversity) is a new approach to online education led by professors Tyler Cowen and Alex Tabarrok of Marginal Revolution."}, {"link": "https://www.mooc-list.com/initiative/iai-academy", "name": "IAI Academy", "description": "IAI Academy is a new educational platform offering courses from world-leading scholars on the ideas that matter. With a unique philosophical take on today’s biggest questions, our courses are made available online, to everyone, for free."}, {"link": "https://www.mooc-list.com/initiative/uninettuno-openuped", "name": "UNINETTUNO OpenupEd", "description": "The first Italian MOOCs portal (Massive Open Online Courses)."}, {"link": "https://www.mooc-list.com/initiative/fun", "name": "FUN", "description": "FUN est une plateforme de MOOC (Massive Open Online Courses, en français « Cours en ligne ouverts à tous ») mise à disposition des établissements de l’enseignement supérieur français et de leurs partenaires académiques dans le monde entier. Lancée par le Ministère de l’Enseignement Supérieur et de la Recherche en octobre 2013, cette initiative vise à fédérer les projets des universités et écoles françaises pour leur donner une visibilité internationale, et permettre à tous les publics d’accéder à des cours variés et de qualité où qu’ils soient dans le monde.Tous les cours présents sur FUN sont conçus par des professeurs d’universités et écoles françaises et leurs partenaires académiques internationaux. Les étudiants et les internautes peuvent suivre ces cours de manière interactive et collaborative, à leur rythme."}, {"link": "https://www.mooc-list.com/initiative/aquent-gymnasium", "name": "Aquent Gymnasium", "description": "Aquent Gymnasium offers free online courses designed to teach creative professionals in-demand skills. We know these skills are in demand because our clients tell us what they are looking for, but can't find."}, {"link": "https://www.mooc-list.com/initiative/coursesites", "name": "CourseSites", "description": "Empowering Learning Through CommunityBlackboard is pleased to support open education opportunities and massive open online courses (MOOCs) through CourseSites by Blackboard, a free, hosted and scalable online learning platform."}, {"link": "https://www.mooc-list.com/initiative/iversity", "name": "Iversity", "description": "iversity.org is the European platform for online learning that enables universities to share a broad range courses with students from around the globe, providing them with the opportunity to earn recognised credentials, no matter where they are. This new dimension of learning is what we describe with the phrase: “study anywhere”.We work in close cooperation with instructors, higher education institutions and knowledge-based companies to provide high-quality courses that are engaging, interactive and fun.These online courses (so-called MOOCs) offer unprecedented opportunities for students and professors alike. They enable professors to experiment with innovative teaching formats and provide students and independent learners with a customised higher education experience: a digital Erasmus for everyone.Our aim is not to replace universities, but to empower academics. Being based in Europe, we are specialised in working within the existing legal and administrative infrastructure and specifically the European Credit Transfer and Accumulation System (ECTS). Some of our partner institutions already award ECTS credits to online learners taking their courses on our platform.In summary: iversity makes higher education more accessible, more affordable and more personalised."}, {"link": "https://www.mooc-list.com/initiative/futurelearn", "name": "FutureLearn", "description": "FutureLearn offers a diverse selection of courses from leading universities and cultural institutions from around the world. These are delivered one step at a time, and are accessible on mobile, tablet and desktop, so you can fit learning around your life.They believe learning should be an enjoyable, social experience, so our courses offer the opportunity to discuss what you’re learning with others as you go, helping you make fresh discoveries and form new ideas.They’re a private company wholly owned by The Open University, with the benefit of over 40 years of their experience in distance learning and online education.They have 57 partners from around the world. These include many of the best UK and international universities, as well as institutions with a huge archive of cultural and educational material, such as the British Council, the British Library, the British Museum, and the National Film and Television School.They also work with a range of internationally renowned organisations - from professional bodies such as the Association of Chartered Certified Accountants (ACCA) and Institution of Engineering and Technology (IET), to businesses like the BBC and Marks & Spencer, to the UK Government.They launched their first courses in September 2013 and since then, 1,651,773 people have joined FutureLearn."}, {"link": "https://www.mooc-list.com/initiative/investoocom", "name": "Investoo.com", "description": "Launched in 2013, Investoo.com is the biggest free online trading school on the internet. Our video courses teach a range of subjects including Forex, MT4 Tutorials, Binary Options Strategies, Advanced Technical Analysis and Price Action Strategies.Our trading school has bee featured on a number of sites including Equities.com, MoneyWeek.com and TraderPlanet.com.Our educational roster includes a number of professional traders and coaches who have been featured on sites such as Investopedia.com, IBTimes, MoneyWeek.com and more. New users on our site can find a variety of educational sections, modules and tutorials. From time to time we also publish our own research, infographics and surveys.We also help beginners find the right broker by comparing the best spread betting companies, Forex brokers and binary options brokers."}, {"link": "https://www.mooc-list.com/initiative/mooc-ed", "name": "MOOC-Ed", "description": "Massive Online Open Course for Educators, or MOOC-Eds, are professional development experiences that will engage you in new technology-enabled learning opportunities that are becoming widely used for both adults and students. Each of the MOOC-Ed courses will include core resources and supplemental materials around a specific topic, while also allowing for a great deal of personalization and flexibility. Because there is not a fixed path or a fixed curriculum everyone will follow, learning can be self-directed. Indeed, participants can — and are expected to — navigate their own paths, consistent with their own goals and the needs of their school or district, while being supported and guided by the facilitators, resources, education experts and fellow participants. And by conducting the course on such a massive scale — literally thousands of educators can participate — participants will also benefit from “crowdsourcing,” a collaborative professional learning experience that uses the “wisdom of the crowd” to discuss ideas, share strategies and resources, and exchange constructive feedback with other participants in similar roles and schools.MOOC-Eds are built on research-based models of effective professional development, professional learning communities, and online communities of practice. The courses focus on authentic, project-based learning, collaboration, and peer-supported learning, rather than tests and grades that are needed in other types of MOOCs. MOOC-Eds enable educators to experience using innovative technologies as learners and collaborators, which will help them gain insights into what these technologies can mean for students. We look forward to having many innovative educators join us in exploring this new form of large-scale, flexible, multimedia, and collaborative professional development."}, {"link": "https://www.mooc-list.com/initiative/ari-campus", "name": "ARI Campus", "description": "ARI fosters a growing awareness, understanding and acceptance of Ayn Rand’s philosophy, Objectivism, in order to create a culture whose guiding principles are reason, rational self-interest, individualism and laissez-faire capitalism­­ — a culture in which individuals are free to pursue their own happiness.How? Our strategy, priorities and programs are informed by Rand’s distinctive view of what sets the direction of a society. It is not the latest election results or media celebrities but the philosophic ideas that shape men’s choices and actions."}, {"link": "https://www.mooc-list.com/initiative/complexity-explorer", "name": "Complexity Explorer", "description": "Complexity Explorer is a web-based repository of educational materials related to complex systems science. Currently under development by researchers and educators at the Santa Fe Institute and Portland State University, Complexity Explorer will host SFI’s online courses, as well as an extensive complex systems glossary and easily searchable databases of syllabi, citations, and other resources related to complex systems topics. Complexity Explorer will also host a “Virtual Laboratory” consisting of open-source simulation programs illustrating complex systems ideas, theories, and tools, accompanied by curricula designed for both teachers and independent learners who want to take advantage of these simulations. All content of the Complexity Explorer website will be open to anyone.More info here."}, {"link": "https://www.mooc-list.com/initiative/federica-web-learning", "name": "Federica Web Learning", "description": "Federica.eu L'Università pubblica online"}, {"link": "https://www.mooc-list.com/initiative/learn-comau", "name": "Learn .com.au", "description": "Learn.com.au is owned and operated by OpenLearning.com, an online social learning platform. OpenLearning's unique social and interactive approach to learning has been adopted with great success by leading institutions and government bodies around the world.More info here."}, {"link": "https://www.mooc-list.com/initiative/polimi-open-knowledge", "name": "Polimi OPEN KNOWLEDGE", "description": "Polimi Open Knowledge is the MOOC programme of Politecnico di Milano."}, {"link": "https://www.mooc-list.com/initiative/virtual-euniversity", "name": "Virtual eUniversity", "description": "More info here."}, {"link": "https://www.mooc-list.com/initiative/master-university", "name": "Master University", "description": ""}, {"link": "https://www.mooc-list.com/initiative/college-st-scholastica", "name": "The College of St. Scholastica", "description": "St. Scholastica is an independent private college with locations across Minnesota, including our original campus in Duluth, plus a brand new presence in Arizona through the Communiversity at Surprise. Enrollment in our undergraduate and graduate programs has grown from 2,200 to 4,000 in the last decade, due, in part, to our commitment to making high-quality education available online and through convenient evening and weekend formats."}, {"link": "https://www.mooc-list.com/initiative/kau", "name": "KAU", "description": "Karlstad Business School"}, {"link": "https://www.mooc-list.com/initiative/open-education", "name": "Open Education", "description": "Join a community of Blackboard clients like you, who are committed to open education. Together we can remove barriers and power learning worldwide."}, {"link": "https://www.mooc-list.com/initiative/lagunita-stanford-online", "name": "Lagunita Stanford Online", "description": "Lagunita - Stanford Online is Stanford's instance of the open-source software release of the Open edX platform, which was developed by the joint Harvard/MIT non-profit organization, and which Stanford engineers have been collaborating on since April 2013. Lagunita hosts many of the free, online courses that are taught by Stanford faculty and made available to lifelong learners around the world for self-enrichment. Lagunita also hosts a variety of professional education opportunities in conjunction with many of Stanford University's schools and departments."}, {"link": "https://www.mooc-list.com/initiative/openclassrooms", "name": "OpenClassrooms", "description": " OpenClassrooms makes education accessible for everyone, everywhere.OpenClassrooms is the leading online education platform in Europe with a passionate community of 3 million of students around the world. Its mission is to make education accessible to all by offering more than 32 fully-accredited online diplomas, based on the skills and jobs of the future.OpenClassrooms revolutionizes learning with a unique approach based on individualized mentoring and real-life projects. OpenClassrooms partners with prestigious universities, engineering schools, and leading tech companies, including Google or IBM, to create its diploma programmes."}, {"link": "https://www.mooc-list.com/initiative/openhpi", "name": "OpenHPI", "description": "openHPI is the educational Internet platform of the German Hasso Plattner Institute, Potsdam. On openHPI you take part in a worldwide social learning network based on interactive online courses covering different subjects in Information and Communications Technology (ICT)."}, {"link": "https://www.mooc-list.com/initiative/udemy", "name": "Udemy", "description": "Udemy helps students make moves. Whether you want to get promoted, break into a new industry, start a company, further a passion, or just accelerate your life, Udemy helps you learn from the amazing instructors in the world, so that you can get there and get there faster."}, {"link": "https://www.mooc-list.com/initiative/schooleducationgateway", "name": "SchoolEducationGateway", "description": ""}, {"link": "https://www.mooc-list.com/initiative/kadenze", "name": "Kadenze", "description": "Kadenze brings together educators, artists, and engineers from leading universities across the globe to provide world-class education in the fields of art and creative technology."}, {"link": "https://www.mooc-list.com/initiative/canvas-network", "name": "Canvas Network", "description": "Canvas Network offers open, online courses taught by educators everywhere. Powered by the Canvas learning management system, Canvas Network provides a place and platform where teachers, students, and institutions worldwide can connect and chart their own course for personal growth, professional development, and academic inquiry.Canvas Network is developed and supported by Instructure, an education technology company that partners with educators, institutions, and technologists to build open educational resources and break down barriers to learning."}, {"link": "https://www.mooc-list.com/initiative/moochouse", "name": "Mooc.house", "description": "mooc.house is an innovative online learning platform developed and operated by the Hasso Plattner Institute for Software Systems Engineering (HPI) based in Potsdam, Germany.mooc.house was launched at the IT fair CeBIT in Hanover in March 2015 and is technically based on the innovative and mature online learning platform openHPI. On openHPI the Hasso Plattner Institute is successfully offering its own online courses about introductory and advanced IT topics since 2012."}, {"link": "https://www.mooc-list.com/initiative/openlearning", "name": "OpenLearning", "description": "OpenLearning's aim is to inspire, motivate and empower through education. We believe that learning can and should be enjoyable, ongoing, and above all effective. Transformative education enhances people’s abilities, promotes dynamic communication, and fosters a lifelong love of learning. We’re committed to creating fun and interactive communities and want our learning vision to spread far beyond educational institutions, branching into boardrooms, offices, team sports, group work, and right through to retirement. We believe that you should never stop learning, and we want to share our passion for accessible education."}, {"link": "https://www.mooc-list.com/initiative/mongodb", "name": "MongoDB", "description": "MongoDB can help you make a difference to the business. Tens of thousands of organizations, from startups to the largest companies and government agencies, choose MongoDB because it lets them build applications that weren’t possible before. With MongoDB, these organizations move faster than they could with relational databases at one tenth of the cost. With MongoDB, you can do things you could never do before.Build your MongoDB expertise with free online courses to teach you how to build and deploy MongoDB. Each class runs for seven weeks with new lesson videos, quizzes and homework assignments released each week."}, {"link": "https://www.mooc-list.com/initiative/opensecuritytraining", "name": "OpenSecurityTraining", "description": "In the spirit of OpenCourseWare and the Khan Academy, OpenSecurityTraining.info is dedicated to sharing training material for computer security classes, on any topic, that are at least one day long.All material is licensed with an open license like CreativeCommons, allowing anyone to use the material however they see fit, so long as they share modified works back to the community.We highly encourage people who already know these topic areas to take the provided material and pursue paid and unpaid teaching opportunities.Those who can, teach."}, {"link": "https://www.mooc-list.com/initiative/novoed", "name": "NovoEd", "description": "NovoEd is the only online learning platform that provides a connected, effective and engaging learning environment for students using a combination of techniques in crowd sourcing, design and analysis of reputation systems, and algorithm design.NovoEd’s philosophy is to advance the online learning experience by making online courses more experiential, interactive, and collaborative. On our platform, students not only have access to lectures by thought leaders and professors from top universities, but they are also able to form teams with people around the world and work on class projects."}, {"link": "https://www.mooc-list.com/initiative/unow", "name": "Unow", "description": "Unow est la meilleure solution digitale pour faire monter en compétence vos collaborateurs. Chaque année, nous aidons des centaines d’entreprises à former leurs salariés de façon simple et efficace."}, {"link": "https://www.mooc-list.com/initiative/weu", "name": "WEU", "description": "WEU (World Education University) is dedicated to one goal – to provide 100% FREE high quality college level education to anyone, anywhere, anytime. There is no tuition, no fees and no costs for textbooks. All we ask in return is that you honor “The WEU Pay-it-Forward Pledge™” and find a way to take your free education and pay it forward.The most important part of WEU is you, the student. Our uniquely interactive, self-paced and completely online platform is one of the most learning-friendly available anywhere. Our platform is designed around you the student and the way you learn. Enrollment includes a Cognitive Learning Assessment (CLA) to help you understand your specific learning preferences, which can lead to improved academic performance, smarter career choices and greater personal satisfaction."}, {"link": "https://www.mooc-list.com/initiative/mooc-t%C3%A9cnico", "name": "MOOC Técnico", "description": "Learn anytime, anywhere."}, {"link": "https://www.mooc-list.com/initiative/edx", "name": "EdX", "description": "EdX offers interactive online classes and MOOCs from the world’s best universities. Online courses from MITx, HarvardX, BerkeleyX, UTx and many other universities. Topics include biology, business, chemistry, computer science, economics, finance, electronics, engineering, food and nutrition, history, humanities, law, literature, math, medicine, music, philosophy, physics, science, statistics and more. EdX is a non-profit online initiative created by founding partners Harvard and MIT."}, {"link": "https://www.mooc-list.com/initiative/coursera", "name": "Coursera", "description": "Coursera was founded in 2012 by two Stanford Computer Science professors who wanted to share their knowledge and skills with the world. Professors Daphne Koller and Andrew Ng put their courses online for anyone to take – and taught more learners in a few months than they could have in an entire lifetime in the classroom.Since then, we’ve built a platform where anyone, anywhere can learn and earn credentials from the world’s top universities and education providers.Every course on Coursera is taught by top instructors from the world’s best universities and educational institutions. Courses include recorded video lectures, auto-graded and peer-reviewed assignments, and community discussion forums. When you complete a course, you’ll receive a sharable electronic Course Certificate.If you want to master a specific career skill, consider joining a Specialization. You’ll complete a series of rigorous courses, tackle hands-on projects based on real business challenges, and earn a Specialization Certificate to share with your professional network and potential employers."}, {"link": "https://www.mooc-list.com/initiative/soundviewprocom", "name": "SoundviewPro.com", "description": "SoundviewPro is a fast-growing library of self-paced video training courses focused around the business and technical skills necessary to succeed in the business world today. Every course is free of charge and consists of a group of classes broken up into sections. Every section contains a short video which allows for easy display on mobile devices and tablets. Each instructor is an expert in their field and Soundview brings that expertise to bear in these concise, skill-based courses."}, {"link": "https://www.mooc-list.com/initiative/stepik", "name": "Stepik", "description": "Stepik has a mission to revolutionize the way people are educated by providing the best learning experience for everyone, scalable and personalized at the same time. By applying machine learning algorithms Stepik aims to make education more efficient and to improve the way people learn and teach.Stepik platform allows for creation and distribution of the interactive educational content, enhanced by various types of auto-graded assignments with a real-time feedback. The platform is suitable for any kind of e-learning activity, from private on-campus classes to MOOCs (massive open online courses), especially for Computer Science and Data Science courses."}, {"link": "https://www.mooc-list.com/initiative/opensap", "name": "OpenSAP", "description": "Keeping pace with the rapidly developing world of information technology is a need that SAP helps to fill with openSAP. openSAP is developed and provided by SAP in cooperation with the Hasso Plattner Institute.openSAP works according to the principle of \"Massive Open Online Courses\" (MOOC): The key difference between MOOCs and other types of e-learning lies in the way MOOCs demand commitment by leveraging tried and trusted classroom concepts in an online delivery format.openSAP uses these concepts in the following ways:- openSAP courses are conducted entirely online. All the material provided can be accessed from any device that is connected to the Internet, be it a desktop, a laptop, a smartphone, or a tablet.- openSAP courses have a defined duration (usually between five and seven weeks) to which course participants need to adhere.- openSAP courses are based on video units, supporting material (slide decks, handouts), and self-tests.- Course participants need to work on weekly assignments and keep to deadlines. The weekly assignment is graded and contributes to the points required to receive a record of achievement.- Course participants can discuss the course content in a discussion forum.- openSAP courses end with a final exam.- Upon successful completion of the weekly assignments and the final exam, participants receive a record of achievement.- openSAP courses are conducted in English.The average duration of the video units is 90 minutes per week. Combined with additional self-study and weekly assignments, the average effort required to complete an openSAP course successfully will be 4–5 hours per week. This makes it easy for course participants to combine courses with their other tasks."}, {"link": "https://www.mooc-list.com/initiative/eduonix", "name": "Eduonix", "description": "Eduonix learning Solutions is the premier training and skill development organization which was started with a vision to bring world class training content, pedagogy and best learning practices to everyone's doorsteps . Eduonix aims to identify and provide the best learning and training environment. It identifies industry veterans and content creators around the globe and bring it to the global audience using number of intuitive platforms for easy and affordable access to quality content. Eduonix offers easy to understand online courses and workshops for everyday people. If you have ever wanted to learn a new skill, but don't want to attend four years of college to do it, we have a solution for you."}, {"link": "https://www.mooc-list.com/initiative/telelab", "name": "TELELAB", "description": "O TELELAB é um programa de educação continuada, do Ministério da Saúde, que disponibiliza CURSOS GRATUITOS, cujo público alvo são os profissionais da área de Saúde."}, {"link": "https://www.mooc-list.com/initiative/esri", "name": "Esri", "description": ""}, {"link": "https://www.mooc-list.com/initiative/uned-abierta", "name": "UNED Abierta", "description": "Fiel a la trayectoria de la UNED de ofrecer a la sociedad contenidos educativos del modo más accesible, UNED Abierta es una plataforma creada por la UNED que aglutina los recursos educativos abiertos (Open Educational Resources, o OER) y que permite, a golpe de click, el acceso a los mismos de forma sencilla y clasificada por tipos de contenidos y canales de distribución de la UNED.UNED Abierta nace con el objetivo de aglutinar, organizar y facilitar el acceso a una gran cantidad de materiales educativos gratuitos disponibles. Además, articula nuevas formas de generar contenidos abiertos de manera colaborativa, en los que participe toda la comunidad educativa: docentes, tutores, investigadores y los propios estudiantes pueden ser generadores y receptores de esos contenidos."}, {"link": "https://www.mooc-list.com/initiative/younico", "name": "Younico", "description": "Younico is a fast-growing Russian MOOC that gives opportunity to launch online courses both from governmental and private educational centres, both at a fee and free of charge depending on the course’s provider. We aim at providing courses from numerous disciplines: from IT to psychology. Length of each course can vary from 1 to 4 months.Who is our audience?These courses will be useful for those who:— Professionals willing to deepen their knowledge.— Travellers willing to learn distantly.— People willing to increase their number of professional contacts.— Future students willing to know more in advance about some educational center, Its programmes and methods of education."}, {"link": "https://www.mooc-list.com/initiative/alison", "name": "ALISON", "description": "Alison was founded in Galway in 2007 and has grown organically to become a major force in online education. Today, with more than 10 million learners in 195 countries, Alison is changing how the world learns."}, {"link": "https://www.mooc-list.com/initiative/udacity-inc", "name": "Udacity Inc", "description": "Udacity mission is to democratize education through the offering of world-class higher education opportunities that are accessible, flexible, and economical. Virtually anyone on the planet with an internet connection and a commitment to self-empowerment through learning can come to Udacity, master a suite of job-ready skills, and pursue rewarding employment."}, {"link": "https://www.mooc-list.com/initiative/emma", "name": "EMMA", "description": "The European Multiple MOOC Aggregator."}, {"link": "https://www.mooc-list.com/initiative/mir%C3%ADada-x", "name": "Miríada X", "description": "Miríada X apuesta por impulsar el conocimiento en abierto en el ámbito iberoamericano de Educación Superior. Un conocimiento libre y gratuito que sea transmitido y enriquecido a través de la red.Miríada X pone a disposición de cualquier interesado Cursos Online Masivos en Abierto (más conocidos como MOOC's) de forma gratuita a través de una plataforma abierta sin restricciones, sin condiciones, sin horarios, sin coste, SIN BARRERAS.Con Miríada X ponemos a disposición de 1.345 universidades iberoamericanas un espacio en el que puedan transmitir conocimiento de forma libre, para fomentar entre todos el intercambio de experiencias e ideas entorno al mismo entre quienes lo reciben a través de la red."}, {"link": "https://www.mooc-list.com/initiative/veduca", "name": "Veduca", "description": "O Veduca é uma empresa brasileira de tecnologia cujo propósito é levar o ensino superior de qualidade a qualquer pessoa que se disponha a aprender."}, {"link": "https://www.mooc-list.com/initiative/saylor-academy", "name": "Saylor Academy", "description": "Saylor Academy’s mission is to open education to all."}]