[{"link": "https://www.mooc-list.com/university-entity/soundviewpro", "name": "SoundviewPro", "description": "SoundviewPro is a fast-growing library of self-paced video training courses focused around the business and technical skills necessary to succeed in the business world today. Every course is free of charge and consists of a group of classes broken up into sections. Every section contains a short video which allows for easy display on mobile devices and tablets. Each instructor is an expert in their field and Soundview brings that expertise to bear in these concise, skill-based courses."}, {"link": "https://www.mooc-list.com/university-entity/loughborough-university", "name": "Loughborough University", "description": "Loughborough University is a public research university in the East Midlands of England. In March 2013, the University announced it had acquired the former broadcast centre at the Queen Elizabeth II Olympic park which it plans to open as a second campus in 2015. It is among the country’s leading universities – consistently ranked among the top 20 in the UK – and is a member of the 1994 Group.It has been a university since 1966, but the institution dates back to 1909, when the then Loughborough Technical Institute began with a focus on skills and knowledge which would be directly applicable in the wider world. Loughborough ranks particularly highly for Engineering and Technology and is noted for its sports-related courses and achievements.More info: http://www.lboro.ac.uk/"}, {"link": "https://www.mooc-list.com/university-entity/university-buffalo", "name": "University at Buffalo", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/davidson-college", "name": "Davidson College", "description": "Davidson College seeks out intellectually curious students who are committed to developing their talents for lives of leadership and service.Small classes enable our renowned faculty to work closely with students, engaging them directly in original research and creative work across the arts, sciences, social sciences, and humanities. In the classroom and beyond, Davidson cultivates students' compassion, creativity, resilience, and moral courage.We nurture these values in a community founded on trust as articulated by the Honor Code and on free, unfettered inquiry. The Davidson Trust supports our campus-wide commitments to access and equal opportunity.Nearly one-quarter of our students compete in Division I athletics, and 80 percent of our students study or work internationally during their Davidson careers. These rich and distinguished offerings enable Davidson graduates to thrive in a global society and exert disproportionate impact for good.More info here."}, {"link": "https://www.mooc-list.com/university-entity/louvainx", "name": "LouvainX", "description": "Université catholique de LouvainMore info: http://www.uclouvain.be/index.html"}, {"link": "https://www.mooc-list.com/university-entity/kings-college-london", "name": "King's College London", "description": "King's is one of the world's leading research and teaching universities based in the heart of London.King’s is dedicated to the advancement of knowledge, learning and understanding in the service of society. King’s is ranked in the top 20 universities in the world (QS World University Rankings 2013), The Sunday Times ‘University of the Year 2010/11’ and the fourth oldest in England. A research-led university based in the heart of London, King’s has more than 25,000 students (of whom more than 10,000 are graduate students) from 145 countries, and some 6,500 employees. King’s is in the second phase of a £1 billion redevelopment programme which is transforming its estate. King’s has an outstanding reputation for providing world-class teaching and cutting-edge research. In the 2008 Research Assessment Exercise (RAE) for British universities, 23 departments were ranked in the top quartile of British universities. 60 per cent of our research is classed by the RAE as world-leading or of internationally-excellent standard. The College is in the top seven UK universities for research earnings and has an overall annual income of nearly £155 million (2011-12). Over the past 180 years King’s has made an extraordinary contribution to modern life, particularly in the areas of humanities, law, the sciences (including a wide range of health areas such as psychiatry, medicine, nursing and dentistry) and social sciences including international affairs. We have played a major role in many of the advances that have shaped modern life, such as the discovery of the structure of DNA and research that led to the development of radio, television, mobile phones and radar. We are the largest centre for the education of healthcare professionals in Europe; no university has more Medical Research Council Centres.King’s Health Partners brings together a world-leading research-led university (King’s College London) and three of London’s most successful NHS Foundation Trusts (Guy’s and St Thomas’, King’s College Hospital and South London and Maudsley).More info here."}, {"link": "https://www.mooc-list.com/university-entity/universitat-oberta-de-catalunya", "name": "Universitat Oberta de Catalunya", "description": "The UOC is an internationally recognised online university with a community of over 50,000 students.More info: http://www.uoc.edu/portal/en/index.html"}, {"link": "https://www.mooc-list.com/university-entity/usmx", "name": "USMx", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/ariel-group", "name": "The Ariel Group", "description": "The Ariel Group is an international training and coaching firm headquartered just outside of Boston, MA. We’re comprised of performing artists and business professionals who believe the workplace functions better when people interact generously and communicate well.More info here."}, {"link": "https://www.mooc-list.com/university-entity/london-school-hygiene-tropical-medicine", "name": "London School of Hygiene & Tropical Medicine", "description": "The London School of Hygiene & Tropical Medicine is a world leader in research and postgraduate education in public and global health.The School’s mission is to improve health and health equity in the UK and worldwide; working in partnership to achieve excellence in public and global health research, education and translation of knowledge into policy and practice.The School was named the world’s leading research-focused graduate school (Times Higher Education 2013), and is now among the world’s top 100 universities by reputation (March 2014). In May 2014, it was ranked in the top 10 of all universities in the world for citation rate by the new EU-supported U-Multirank database, and fourth in the world for impact in medical sciences by the Leiden Ranking.The School’s research income has grown to over £79 million per year from national and international funding sources including the UK government, the European Commission, the Wellcome Trust and the Bill & Melinda Gates Foundation. The School’s multidisciplinary expertise includes clinicians, epidemiologists, statisticians, social scientists, molecular biologists and immunologists.The School’s staff, students and alumni work in more than 180 countries in government, academia, international agencies and health services.More info here."}, {"link": "https://www.mooc-list.com/university-entity/mongodb-university", "name": "MongoDB University", "description": "MongoDB University is an online learning platform run by MongoDB available to anyone in the world with an internet connection. Our free courses will teach you how to develop for and administer MongoDB quickly and efficiently.Frequent assessments help you verify your understanding, and at the end of a course, you'll receive a certificate of completion from MongoDB. You'll also become a member of MongoDB's community of cutting-edge NoSQL technologists. Over time, we'll be adding classes on schema design, advanced scaling and replication, and other topics, so check back often!MongoDB University’s platform was developed under a collaboration with edX, the not-for-profit consortium between MIT, Harvard and Berkeley."}, {"link": "https://www.mooc-list.com/university-entity/universidad-de-cantabria", "name": "Universidad de Cantabria", "description": "La Universidad de Cantabria pone a disposición de sus alumnos toda una serie de recursos que les permitan adquirir una formación integral. Sus planes de estudios buscan en este contexto un adecuado equilibrio entre práctica y teoría.More info here."}, {"link": "https://www.mooc-list.com/university-entity/international-monetary-fund-imf", "name": "International Monetary Fund (IMF)", "description": "The International Monetary Fund (IMF) is an international organization of 188 countries, working to foster global monetary cooperation, secure financial stability, facilitate international trade, and promote high employment and sustainable economic growth. The IMF supports its membership by providing: policy advice to governments and central banks; research, statistics, forecasts, and analysis; loans to help countries overcome economic difficulties; and technical assistance and training to officials to help countries improve the management of their economies.The Institute for Capacity Development oversees the IMF training program on topics spanning macroeconomic analysis, monetary and fiscal policy, macro-financial linkages, balance of payments issues, financial markets and institutions, as well as statistical and legal frameworks in these areas.The IMF’s online learning program receives generous financial support from the Government of Belgium.More info here."}, {"link": "https://www.mooc-list.com/university-entity/incibe", "name": "INCIBE", "description": "INCIBE, the Instituto Nacional de Ciberseguridad de España, S.A. (Spanish National Cybersecurity Institute) is an organisation dependent on the Ministry for Industry, Energy and Tourism through SETSI, the Secretary of State for Telecommunications and the Information Society, and is the benchmark institution with regard to the development of cybersecurity, and of digital trust for the general public, for RedIRIS and for businesses, especially sectors of strategic importance.More info here."}, {"link": "https://www.mooc-list.com/university-entity/master-university", "name": "Master University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-maryland-college-park", "name": "University of Maryland, College Park", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/%C3%A9cole-des-ponts-paristech", "name": "École des Ponts ParisTech", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/pontificia-universidad-cat%C3%B3lica-de-valpara%C3%ADso", "name": "Pontificia Universidad Católica de Valparaíso", "description": "Desde el inicio de sus actividades académicas, en Marzo de 1928, la Pontificia Universidad Católica de Valparaíso ha desarrollado una ininterrumpida labor académica, de investigación y extensión, orientando su quehacer al cultivo de las artes, las ciencias y conocimiento, siempre bajo el lema legado por sus fundadores: Fe y Trabajo. Es una de las 19 instituciones en el mundo con el título de \"Pontificia\", reconocimiento otorgado por la Santa Sede.More info here."}, {"link": "https://www.mooc-list.com/university-entity/wesleyan-university", "name": "Wesleyan University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/universidade-federal-de-santa-catarina-ufsc", "name": "Universidade Federal de Santa Catarina (UFSC)", "description": "More info: http://ufsc.br/"}, {"link": "https://www.mooc-list.com/university-entity/deeplearningai", "name": "deeplearning.ai", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-dundee", "name": "University of Dundee", "description": "The University of Dundee is internationally recognised for the quality of its teaching and research and has a core mission to transform lives across society.Dundee has particular strengths in life sciences and medical research. The College of Life Sciences at Dundee is one of the largest and most productive Life Sciences research institutes in Europe and has been recognised in the Biotechnology and Biological Sciences Research Council Excellence with Impact Awards for ‘Greatest Delivery of Impact’.The School of Medicine is among the top-rated in the UK and hosts research expanding from “the cell to the clinic to the community”.The University is the central hub for a multi-million pound biotechnology sector in the east of Scotland, which now accounts for 16% of the local economy.More than 17,000 students are enrolled at Dundee, helping make the city Scotland’s most student-friendly. With high-quality teaching, world-leading research, and a £200 million investment in a compact, friendly campus with an unrivalled position in the heart of the city centre, the University of Dundee has been rated number one in Scotland and in the UK Top 10 for the past five years in the Times Higher Education Student Experience Survey.The University was awarded the Queen’s Anniversary Prize for Higher Education in 2014 for the work of the Centre for Anatomy and Human Identification, one of the world’s foremost institutions for the study and application of human anatomy, forensic human identification, disaster victim identification and forensic and medical art.More info here."}, {"link": "https://www.mooc-list.com/university-entity/school-education-gateway-directorate-general-education-and-culture-european", "name": "School Education Gateway, Directorate General for Education and Culture of the European Commission", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/st-georges-university-london", "name": "St George's, University of London", "description": "St George’s is the UK’s only university dedicated to medical and health sciences education, training and research.The university provides a world-class multi-professional health sciences education that equips graduates to meet today’s healthcare needs through relevant scientific research, clinical excellence, strong interpersonal skills and team-based working. Sharing a clinical environment with a major London teaching hospital, its innovative approach to education results in well-rounded, highly skilled clinicians, scientists, and health and social care professionals.St George’s has more than 250 years of excellence and innovation in research and education resulting in groundbreaking advances in medicine and healthcare. Alumni include Edward Jenner, John Hunter, Muriel Powell and Patrick Steptoe. The university has three research institutes focus on biomedical and scientific discovery, advancing the prevention and treatment of disease in the fields of population health, heart disease and infection - three of the greatest challenges to global health in the 21st century.More info here."}, {"link": "https://www.mooc-list.com/university-entity/charles-darwin-university", "name": "Charles Darwin University", "description": "Charles Darwin University (CDU) is founded on 50 years of delivering tertiary education in the Northern Territory (NT), Australia. Today, CDU offers a fresh approach to education, training, research and knowledge application. As a multi-sector education provider, CDU provides unique pathways for students, from school-based vocational training through to advanced research degrees. Our students are drawn from the local area, across Australia and overseas, consisting of Indigenous and international students, school leavers, and mature age people returning to study.More info here."}, {"link": "https://www.mooc-list.com/university-entity/hz-university-applied-sciences", "name": "HZ University of Applied Sciences", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/universidad-tecnologica-de-chile-inacap", "name": "Universidad Tecnológica de Chile (INACAP)", "description": "La Universidad Tecnológica de Chile INACAP se caracteriza por especializar su quehacer en áreas tecnológicas y profesionales, a través de un enfoque educativo de carácter activo y práctico (Aprender Haciendo) para la formación de profesionales competentes.More info here."}, {"link": "https://www.mooc-list.com/university-entity/designers-learning", "name": "Designers for Learning", "description": "Designers for Learning is organized as a not-for-profit corporation in the State of Illinois, and operates exclusively for charitable purposes in accordance with section 501(c)(3) of the U.S. Internal Revenue Code. Designers for Learning promotes service-learning opportunities through collaboration with schools, students, and volunteers.More info here."}, {"link": "https://www.mooc-list.com/university-entity/climate-and-migration-coalition", "name": "The Climate and Migration Coalition", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/universidad-ort-uruguay", "name": "Universidad ORT Uruguay", "description": "La Universidad ORT Uruguay, fundada en 1942 como escuela técnica sin fines de lucro, es en el presente la mayor universidad privada del país.More info here."}, {"link": "https://www.mooc-list.com/university-entity/technische-universit%C3%A4t-m%C3%BCnchen-tum", "name": "Technische Universität München (TUM)", "description": "Technische Universität München (TUM) is one of Europe’s top universities. It is committed to excellence in research and teaching, interdisciplinary education and the active promotion of promising young scientists. The university also forges strong links with companies and scientific institutions across the world. TUM was one of the first universities in Germany to be named a University of Excellence. In the international Shanghai Ranking (ARWU), TUM was rated the number one German university both in 2011 and 2013.More info: http://www.tum.de/"}, {"link": "https://www.mooc-list.com/university-entity/university-east-anglia", "name": "University of East Anglia", "description": "The University of East Anglia (UEA) is the number one university in the UK for student satisfaction in the 2013 Times Higher Education Student Experience Survey. An internationally renowned university based on a distinctive and attractive campus, in the historic city of Norwich, we pride ourselves on the excellent academic, social and cultural facilities which we offer to over 15,000 students.UEA is ranked in the top 1% of HE institutions in the world and is a leading member of the Norwich Research Park, one of Europe's biggest concentrations of researchers in the fields of environment, health and plant science.More info: http://www.uea.ac.uk/"}, {"link": "https://www.mooc-list.com/university-entity/cardiff-university", "name": "Cardiff University", "description": "Founded in 1883, Cardiff is established as one of Britain’s leading universities.Our research has global impact and is led by world-class staff who share their knowledge through teaching.More info: http://www.cardiff.ac.uk/"}, {"link": "https://www.mooc-list.com/university-entity/hong-kong-polytechnic-university", "name": "The Hong Kong Polytechnic University", "description": "An Internationally Recognized University - Located in the heart of AsiaThe Hong Kong Polytechnic University is committed to education and preparing students to becoming global citizens through quality learning and teaching. We are internationally known for our excellence in professional education and innovative research.Established in 1937, we have nurtured over 355,000 graduates, many of whom have become leaders in their professional fields, contributing their knowledge and expertise to building Hong Kong's thriving economy and improving the world.We have the largest student community out of all Hong Kong's publicly-funded universities, with some 32,000 full-time and part-time students on campus annually. In addition, the University’s Student Exchange Programme offers students opportunities to study and experience different cultures at over 220 renowned universities across 28 countries and regions. Every year, around 550 PolyU students go on exchanges while a similar number of inbound exchange students come to the University.Over 200 programmes, some unique in Hong Kong, are offered by our six faculties and two schools, each with its own unique strengths. We are the only university in Hong Kong whose curriculum mandates a Work-Integrated Education (WIE) component to facilitate work-based learning. Therefore our graduates are highly sought after by employers.More info here."}, {"link": "https://www.mooc-list.com/university-entity/universidad-del-rosario", "name": "Universidad del Rosario", "description": "La Universidad del Rosario, desde 1653, ha sido una comunidad universitaria que mueve las fronteras de la ciencia a través de la investigación, e incorpora las mejores prácticas de gestión universitaria. La calidad y los resultados fundamentan nuestro reconocimiento nacional e internacional.More info here."}, {"link": "https://www.mooc-list.com/university-entity/icahn-school-medicine-mount-sinai", "name": "Icahn School of Medicine at Mount Sinai", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/universidad-de-zaragoza", "name": "Universidad de Zaragoza", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/rwth-aachen", "name": "RWTH Aachen", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-urbino", "name": "University of Urbino", "description": "The University of Urbino dates back to 1506 when Duke Guidobaldo I founded the “Collegio dei Dottori”, and from its inception, it continued to grow and develop.More info here."}, {"link": "https://www.mooc-list.com/university-entity/sap", "name": "SAP", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/government-and-heritage-library-state-library-north-carolina", "name": "Government and Heritage Library of the State Library of North Carolina", "description": "The Government and Heritage Library (GHL) of the State Library of North Carolina celebrates the study, understanding, and appreciation of North Carolina’s cultural heritage. The Genealogical Services section offers access to an extensive collection of published materials, including family histories, published abstracts, and county, state, and federal records, census data as well as county records housed in the State Archives of North Carolina. By offering in-person and remote research assistance, workshops, and other genealogy related events, the GHL helps thousands of people conduct their family research each year."}, {"link": "https://www.mooc-list.com/university-entity/georgia-institute-technology", "name": "Georgia Institute of Technology", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/ucas", "name": "UCAS", "description": "UCAS is an independent charity providing information, advice, and admissions services to inspire and facilitate educational progression. Our services support young people making choices after their GCSEs, as well as those applying for undergraduate and postgraduate courses.UCAS’ vision is to be at the heart of connecting people to higher education aiming to be in a position to provide more and better services to learners and those who support them, to ensure that universities and colleges can efficiently recruit and select the students they want, and to support others who have a stake in developing the benefits of our unique national asset – a single, fair, transparent service that supports progression to higher education."}, {"link": "https://www.mooc-list.com/university-entity/universitat-aut%C3%B2noma-de-barcelona", "name": "Universitat Autònoma de Barcelona", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/universidad-ceu-cardenal-herrera", "name": "Universidad CEU Cardenal Herrera", "description": "La Universidad CEU Cardenal Herrera pertenece a la Fundación CEU San Pablo, institución benéfico-docente sin ánimo de lucro y con más de 75 años de experiencia en el campo de la enseñanza. Los promotores de la Fundación CEU San Pablo pertenecen a la Asociación Católica de Propagandistas, organismo creado en 1908 por el Padre Ayala.La Fundación, fundada en 1933 por la Asociación Católica de Propagandistas (ACdP), cuenta con 25 centros docentes donde se imparten más de 190 programas educativos, que abarcan desde la Educación Infantil hasta estudios de posgrado y formación profesional. En la actualidad, posee sedes en Madrid, Barcelona, Valencia, Murcia, Alicante, Vigo, Jerez, Elche, Sevilla y Valladolid.El proyecto educativo de la Fundación se basa en los principios del Humanismo Cristiano y el compromiso con la excelencia académica y la formación integral del alumno. Además, la Fundación ha impulsado iniciativas para el desarrollo y avance de la sociedad como el Congreso de Víctimas del Terrorismo, el Instituto de Humanidades Ángel Ayala, o el Congreso de Católicos y Vida Pública.La Fundación inauguró sus obras en Valencia en 1971 y en Elche (Alicante) en 1994. La Generalitat Valenciana aprobó la Ley de creación de la Universidad CEU Cardenal Herrera (año 1999) que viene funcionando como tal desde el curso 2000-2001. Consulta la Ley 7/1999 de 3 de diciembre de 1999.La Universidad CEU Cardenal Herrera de carácter católico, nace con vocación de servicio a la sociedad, por ello asume el compromiso de conectar estrechamente la actividad universitaria con el mundo profesional específico de cada alumno.More info: http://www.uchceu.es/"}, {"link": "https://www.mooc-list.com/university-entity/purdue-university", "name": "Purdue University", "description": "Purdue University is a vast laboratory for discovery. The university is known not only for science, technology, engineering, and math programs, but also for our imagination, ingenuity, and innovation. It’s a place where those who seek an education come to make their ideas real — especially when those transformative discoveries lead to scientific, technological, social, or humanitarian impact.Founded in 1869 in West Lafayette, Indiana, the university proudly serves its state as well as the nation and the world. Academically, Purdue’s role as a major research institution is supported by top-ranking disciplines in pharmacy, business, engineering, and agriculture. More than 39,000 students are enrolled here. All 50 states and 130 countries are represented. Add about 950 student organizations and Big Ten Boilermaker athletics, and you get a college atmosphere that’s without rival.More info here."}, {"link": "https://www.mooc-list.com/university-entity/universit%C3%A9-sorbonne-paris-cit%C3%A9", "name": "Université Sorbonne Paris Cité", "description": "L’Université Sorbonne Paris Cité rassemble 8 établissements d’enseignement supérieur et 5 organismes de recherche. Elle mène des activités de recherche et de formation dans toutes les grandes disciplines scientifiques. C'est le premier regroupement français pour la santé et les sciences du vivant, les aires culturelles, les langues et civilisations.L’université figure dans les premiers rangs mondiaux, dans de nombreuses disciplines des sciences humaines et sociales, en mathématiques et en sciences de la terre et de l’univers.Les nouvelles formes pédagogiques, mélangeant les enseignements numériques et classiques, sont au cœur du projet pédagogique de USPC qui soutient et développe une offre innovante de formations des établissements membres, misant notamment sur l’internationalisation et l’interdisciplinarité.Depuis 2012, l’Université Sorbonne Paris Cité soutient l’innovation pédagogique, à travers :la création de son Service d’Accompagnement des enseignants aux pédagogies innovantes (SAPIENS), lequel a développé une expertise en matière de production de Moocs. C’est aussi ce Service qui porte la relation avec le GIP Fun-Mooc pour l’ensemble des universités et établissements membres de USPC.l’élargissement de Ilumens (Département de simulation en santé issu de l’Université Paris Descartes) à l’ensemble des Facultés de médecine des universités membres de USPC.le projet de Mooc Factory du Centre en santé publique franco-allemand, Virchow-Villermé, pleinement intégré à cette dynamique ;le Centre de Recherches Interdisciplinaires (CRI) qui développe des Moocs, Spocs… entre autres formes d’innovations pédagogiques.L’évolution des pratiques d’enseignement et d’apprentissage est au cœur de la stratégie de USPC.More info here."}, {"link": "https://www.mooc-list.com/university-entity/feedmyhappy", "name": "FeedMyHappy", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/wits-university", "name": "Wits University", "description": "The University of the Witwatersrand, Johannesburg, also known as Wits University is a leading, internationally-ranked, research-intensive University located in Johannesburg, South Africa, the economic heartland of Africa. Committed to academic and research excellence, Wits generates high level scarce skills for a globally competitive world, while addressing local social and economic development. At the forefront of a changing society, Wits is a social leader, dedicated to advancing the public good.Wits is known for its work in deep level mining, science, health sciences, accountancy, law, governance, and the humanities, amongst others. It houses five Faculties which comprise 34 Schools. The five Faculties are Commerce, Law and Management; Engineering and the Built Environment; Health Sciences, Humanities and Science.The University offers approximately 3 600 courses to about 30 800 full-time students, of whom about a third are postgraduate and 55% are female. Almost 65% of all doctoral candidates and about half of all enrollments are in the Science, Engineering and Technology fields. Wits has developed about 130 000 graduates in its 92 years of existence. It has a proud record in that about 87% of all publications are in accredited international journals.More info here."}, {"link": "https://www.mooc-list.com/university-entity/launchcode", "name": "LaunchCode", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/london-south-bank-university", "name": "London South Bank University", "description": "Since 1892, we've been providing vocationally-relevant, accredited and professionally recognised education.We're a cosmopolitan university with over 25,000 students drawn from over 130 countries. We received the highest possible rating for the quality of our education from the independent Quality Assurance Agency (QAA).More info: http://www.lsbu.ac.uk/"}, {"link": "https://www.mooc-list.com/university-entity/lund-university", "name": "Lund University", "description": "Lund University seeks to be a world-class university that works to understand, explain and improve our world and the human condition. Lund University was founded in 1666 and for a number of years has been ranked among the world’s top 100 universities.More info here."}, {"link": "https://www.mooc-list.com/university-entity/pontificia-universidad-cat%C3%B3lica-del-per%C3%BA-pucp", "name": "Pontificia Universidad Católica del Perú (PUCP)", "description": "La Pontificia Universidad Católica del Perú (PUCP), es la número uno del país. Este liderazgo se basa en la calidad de los profesores, el prestigio de los egresados, nuestros desarrollos tecnológicos, eventos culturales y la calidad de las publicaciones académicas.More info here."}, {"link": "https://www.mooc-list.com/university-entity/yad-vashem", "name": "Yad Vashem", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/universidad-carlos-iii-de-madrid-uc3m", "name": "Universidad Carlos III de Madrid (UC3M)", "description": "Universidad Carlos III de Madrid (UC3M) is an innovative public university committed to the improvement of society through teaching of the highest quality and cutting-edge research in line with stringent international guidelines. UC3M has three degree-granting Schools, in addition to a School of Graduate Studies and a Doctoral School.Established in 1989, UC3M develops its activities in four campuses and enrolls about 18.000 students in undergraduate and graduate programs (18% are foreign students). UC3M has a large offer of programs taught in English and is the 1st university in Spain and the 3rd in Europe in terms of undergraduate students taking part in the Erasmus student exchange programs. UC3M is included in the QS Top 50 Under 50, a ranking of the world’s top 50 universities established within the last 50 years.More info here."}, {"link": "https://www.mooc-list.com/university-entity/ayn-rand-institute", "name": "The Ayn Rand Institute", "description": "THE CENTER FOR THE ADVANCEMENT OF OBJECTIVISMARI offers a variety of educational experiences to promote greater understanding of Ayn Rand’s philosophy and, through the writing and speaking of our experts, advocates her principles of reason, rational self-interest and laissez-faire capitalism."}, {"link": "https://www.mooc-list.com/university-entity/dublin-city-university", "name": "Dublin City University", "description": "Dublin City University is a young, dynamic and ambitious Irish university with a distinctive mission to transform lives and societies through education, research and innovation. Since admitting students in 1980, DCU has grown substantially, to over 17,000 students and 1,800 staff, across 3 academic campuses. DCU’s student body is cosmopolitan, with 109 countries represented within the student body. The number of DCU alumni worldwide now exceeds 57,000.DCU currently delivers more than 200 programmes through five faculties: DCU’s Institute of Education, Humanities and Social Sciences, Science and Health, Engineering and Computing and DCU Business School. DCU has a proud 30-year history of delivering distance and online higher education through DCU Connected and it is home to the National Institute of Digital Learning. The University is a member of both the International Council for Open and Distance Education and European Association of Distance Teaching Universities.DCU has a strong social mission and has obtained University of Sanctuary status. The University provides a range of initiatives and commits to welcoming asylum seekers and refugees into the university community. DCU is one of only two European universities to be designated as a Changemaker Campus by Ashoka U, an initiative that encourages students to learn about social innovation and how to create and implement sustainable, positive change in society.Research is a high priority at DCU, with the focus on global grand challenges, such as healthcare needs, sustainable development, multicultural societies, and conflict resolution. DCU’s enterprise focus is reflected in its strong industry-academic collaborations and successful execution of licences arising from its intellectual property portfolio. DCU’s excellence is recognised internationally and it is ranked in Times Higher Education’s ‘Top 100 under 50’. DCU is also the only Irish university to be represented in the prestigious European university network, The European Consortium of Innovative Universities.More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-sydney", "name": "The University of Sydney", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/universidad-del-pa%C3%ADs-vasco-euskal-herriko-unibertsitatea", "name": "Universidad del País Vasco/ Euskal Herriko Unibertsitatea", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/universidad-externado-de-colombia", "name": "Universidad Externado de Colombia", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/box-hill-institute", "name": "Box Hill Institute", "description": "Box Hill Institute is a leading Victorian vocational and higher education provider known for our collaborative and creative approach to education in Australia and overseas. The Institute has a long and diverse history and over the years has been the recipient of many awards and achievements demonstrating Australia-wide recognition for our efforts.Box Hill Institute offers a wide variety of courses to both local and international students, from apprenticeships to degrees, short courses to diplomas, and in a range of delivery modes including full time, part time and off campus.Our Teaching Centres enable students to achieve their career goals, we add value to business and deliver innovation and technological change to industry. Our high quality strategic relationships, facilities and programs make us recognised leaders in a number of vocational areas.More info here."}, {"link": "https://www.mooc-list.com/university-entity/association-chartered-certified-accountants-acca", "name": "Association of Chartered Certified Accountants (ACCA)", "description": "ACCA (the Association of Chartered Certified Accountants) is the global body for professional accountants. We aim to offer business-relevant, first-choice qualifications to people of application, ability and ambition around the world who seek a rewarding career in accountancy, finance and management.Founded in 1904, ACCA has consistently held unique core values: opportunity, diversity, innovation, integrity and accountability. We believe that accountants bring value to economies in all stages of development. We aim to develop capacity in the profession and encourage the adoption of consistent global standards. Our values are aligned to the needs of employers in all sectors and we ensure that, through our qualifications, we prepare accountants for business. We work to open up the profession to people of all backgrounds and remove artificial barriers to entry, ensuring that our qualifications and their delivery meet the diverse needs of trainee professionals and their employers."}, {"link": "https://www.mooc-list.com/university-entity/universidad-de-ibagu%C3%A9", "name": "Universidad de Ibagué", "description": "More info: http://www.unibague.edu.co/"}, {"link": "https://www.mooc-list.com/university-entity/university-melbourne", "name": "University of Melbourne", "description": "More info: http://www.unimelb.edu.au"}, {"link": "https://www.mooc-list.com/university-entity/fachhochschule-potsdam", "name": "Fachhochschule Potsdam", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/canberra-institute-technology", "name": "Canberra Institute of Technology", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/berklee-college-music", "name": "Berklee College of Music", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/international-institute-executive-careers-iiec", "name": "International Institute of Executive Careers (IIEC)", "description": "The International Institute of Executive Careers™ (IIEC™) is the leading authority in the field of Global Accreditation for MBA & Executive Programs, Outplacement, Career Transition Coaching, and Publishing & Research. IIEC is formed by the global professional communities of ManagingDirectors.Org, GeneralManagers.Org, ProjectDirectors.Org, ProjectManagers.Org, ServiceDirectors.Org, and ServiceManagers.Org. For a \"Real Global World, Real Global Accreditation\".More info here."}, {"link": "https://www.mooc-list.com/university-entity/pontificia-universidad-javeriana", "name": "The Pontificia Universidad Javeriana", "description": "Founded in 1623 and governed by the Jesuits, the Universidad Javeriana is a private and not-for-profit institution of higher education. It is legally established under ecclesiastical law, recognized by the Colombian State to operate and authorized to award academic degrees.Formally accredited, it has a flexible and articulated academic offering focused on the personal guidance of the student that is characteristic of Jesuit education, and well supported by Information and Communication Technologies.The University is nationally recognized for its influence on Colombia’s development. It articulates with other higher education institutions and national and international research and development centers, especially with those belonging to the Society of Jesus.The comprehensive formation of the human being and the conservation, transmission and development of science and culture, transcending the purely informative and technical aspects of education, characterize its specific educational purpose.With an interdisciplinary vocation, the University currently encompasses 22 schools and 242 academic programs for undergraduate and graduate students. Its 3,750 professors serve over 42.000 students at its headquarters in Bogota and in Cali. The continuing education programs offered on campus and on-line, serve some 30,000 more each year, having presence in Barranquilla, Pereira, Pasto, Manizales and Bucaramanga (Colombia), as well as Guatemala, Panamá, República Dominicana and Honduras (Centro América).Since 2003 the University created two educational innovation centers supporting teaching, research and extension services through the use of information and communication technology (ICT) for strengthening the culture of its reflective use in the educational context for on campus and online programs as well as MOOCs.More info here."}, {"link": "https://www.mooc-list.com/university-entity/caf-banco-de-desarrollo-de-america-latina", "name": "CAF – banco de desarrollo de América Latina", "description": "Constituido en 1970 y conformado por 19 países y 13 bancos privados, somos un banco de desarrollo comprometido con mejorar la calidad de vida de todos los latinoamericanos. Nuestras acciones promueven el desarrollo sostenible y la integración de la región. Ofrecemos apoyo financiero y asesoramiento a los sectores público y privado de nuestros países accionistas. Movilizamos recursos desde los mercados internacionales hacia América Latina. CAF tiene una visión integral del desarrollo, producto de un importante programa de investigación y generación de conocimiento en temas de desarrollo económico, social y ambiental y de asesoramiento en políticas públicas."}, {"link": "https://www.mooc-list.com/university-entity/turku-university-applied-sciences", "name": "Turku University of Applied Sciences", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/maricopa-community-colleges", "name": "The Maricopa Community Colleges", "description": "We are the Maricopa Community Colleges. We are 10 colleges, 2 skill centers and numerous education centers, all dedicated to educational excellence and to meeting the needs of businesses and the citizens of Maricopa County. Each college is individually accredited, yet part of a larger system - the Maricopa County Community College District, which is one of the largest providers of higher education in the United States.Whether you are just out of high school, beginning or re-entering college or seeking lifelong education, you'll find that the Maricopa Community Colleges offer a wide range of opportunities for you to create the educational future that's right for you. We offer approximately 1,000 occupational programs (degrees and certificates), and 37 academic associate degrees, and a total of 10,254 courses. We're the largest provider of health care workers and job training in Arizona, making us a major resource for business and industry and the place to be if you're seeking education and job training.You can learn in the way that's best for you, because we have flexible course delivery, including field based, hybrid, in person, independent study, Internet, mixed media, print based, private instruction, evening, weekend and open-entry/open-exit choices.If you see a four-year degree in your future, we have transfer agreements with public and private colleges and universities that enable seamless transitions to four-year institutions.More info: http://www.maricopa.edu/"}, {"link": "https://www.mooc-list.com/university-entity/university-geneva", "name": "University of Geneva", "description": "Founded in 1559 by Jean Calvin, the University of Geneva (UNIGE) is dedicated to thinking, teaching, dialogue and research. With 16’000 students of more than 140 different nationalities, it is Switzerland’s second largest university.More info here."}, {"link": "https://www.mooc-list.com/university-entity/monash-university", "name": "Monash University", "description": "Monash University is one of Australia's leading universities ranked in the world's top 1%. (THE World University Rankings)Monash University was established in Melbourne, Australia in 1958. In little more than 50 years, the University has become Australia’s largest university, earning an enviable national and international reputation for research and teaching excellence. Monash University is the youngest member of the Group of Eight, the coalition of Australia’s most prestigious research-intensive universities. Monash is located in Melbourne, Malaysia, South Africa, India, China and Italy.Monash is a global university possessing the ambition and ability to address momentous global challenges. It has campuses in Australia, China, Malaysia and South Africa as well as an education centre in Italy, and major partnerships with universities in the UK and India.More info: http://www.monash.edu.au/"}, {"link": "https://www.mooc-list.com/university-entity/universit%C3%A9-paris-ouest-nanterre-la-d%C3%A9fense", "name": "Université Paris Ouest Nanterre La Défense", "description": "Université Paris Ouest Nanterre La Défense.More info here."}, {"link": "https://www.mooc-list.com/university-entity/tafe-nsw-%E2%80%93-sydney-institute", "name": "TAFE NSW – Sydney Institute", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-new-mexico", "name": "University of New Mexico", "description": "Founded in 1889 as New Mexico’s flagship institution, The University of New Mexico now occupies nearly 800 acres near old Route 66 in the heart of Albuquerque, a metropolitan area of more than 500,000 people. From the magnificent mesas to the west, past the banks of the historic Rio Grande to the Sandia Mountains to the east, Albuquerque is a blend of culture and cuisine, styles and stories, people, pursuits and panoramas.More info: http://www.unm.edu/"}, {"link": "https://www.mooc-list.com/university-entity/institut-mines-telecom", "name": "Institut Mines-Telecom", "description": "More info: http://www.mines-telecom.fr"}, {"link": "https://www.mooc-list.com/university-entity/northwestern-university", "name": "Northwestern University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/tennessee-board-regents-tbr", "name": "Tennessee Board of Regents (TBR)", "description": " The Tennessee Board of Regents (TBR) system consists of 46 institutions with a combined annual enrollment of over 200,000 students, making it one of the nation's largest systems of public higher education. TBR's 6 state universities, 13 community colleges and 27 colleges of applied technology offer outreach for instructional delivery in all of Tennessee's 95 counties. The TBR system is a $2.2 billion per year enterprise."}, {"link": "https://www.mooc-list.com/university-entity/iese-business-school", "name": "IESE Business School", "description": "For over fifty years, IESE, the graduate business school of the University of Navarra, has been at the forefront of management education, developing and inspiring business leaders who strive to make a deep, positive and lasting impact on the people, companies and society they serve.More info: http://www.iese.edu/"}, {"link": "https://www.mooc-list.com/university-entity/communaut%C3%A9-universit%C3%A9-grenoble-alpes", "name": "Communauté Université Grenoble Alpes", "description": "Née le 31 décembre 2014, la Communauté Université Grenoble Alpes regroupe quatre institutions membres (l’Université Grenoble Alpes, Grenoble INP, le CNRS et l’INRIA) et à ce jour quatre institutions associées (l’Université Savoie Mont-Blanc, Sciences Po Grenoble, l’ENSAG et le CEA).Elle porte le projet “Université Grenoble Alpes : Université de l’innovation”, (lauréat IDEX 2016), qui ambitionne de créer une université de recherche et d’innovation pluridisciplinaire, visible internationalement, et en lien étroit avec son territoire.Pionnière dans le numérique, elle est engagée depuis plusieurs années dans l’innovation pédagogique et la transdisciplinarité de sa recherche et de ses formations avec ses 62 000 étudiants, ses 3 700 doctorants et ses 7 000 enseignants et/ou chercheurs.More info here."}, {"link": "https://www.mooc-list.com/university-entity/universit%C3%A0-degli-studi-di-padova", "name": "Università degli Studi di Padova", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/northwest-colorado-boces", "name": "Northwest Colorado BOCES", "description": "Northwest Colorado Board of Cooperative Educational Services (NW BOCES) is a cooperative service agency authorized under Colorado statutes, serving seven school districts in northwest Colorado. NW BOCES provides shared services and programs which supplement and support those of the districts.Northwest Colorado BOCES originated in 1967 as the Child Study Center, when three founding districts recognized a need to provide extra services to children with special needs, by sharing specialists and funding. The original charter - to provide special education services among geographically distant mountainous districts - remains a primary focus today.More info: http://nwboces.org/"}, {"link": "https://www.mooc-list.com/university-entity/university-basel", "name": "University of Basel", "description": "The University of Basel has an international reputation of outstanding achievements in research and teaching. Founded in 1460, the University of Basel is the oldest university in Switzerland and has a history of success going back over 550 years.As a comprehensive university offering a wide range of high-quality educational opportunities, the University of Basel attracts students from Switzerland and the entire world, offering them outstanding studying conditions as they work towards their Bachelor’s, Master’s or PhD degrees. Today, the University of Basel has around 13,000 students from over a hundred nations, including 2,700 PhD students.The University of Basel has seven faculties covering a wide spectrum of academic disciplines. At the same time, the University has positioned itself amidst the international competition in the form of five strategic focal areas: Life Scientists, Visual Studies, Nanosciences, Sustainability and Energy Research and European and Global Studies. In international rankings, the University of Basel is regularly placed among the 100 top universities in the world thanks to its research achievements.The University of Basel has deep roots in the economically powerful and culturally rich Basel region. The University also works closely with domestic and international partners to make relevant contributions to the advancement of the sciences and society. This also means that the University of Basel pays particular attention to aspects of sustainability, equal opportunity and knowledge transfer.More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-leeds", "name": "University of Leeds", "description": "More info: http://www.leeds.ac.uk/"}, {"link": "https://www.mooc-list.com/university-entity/university-wisconsin%E2%80%93madison", "name": "University of Wisconsin–Madison", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/snux", "name": "SNUx", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/college-st-scholastica", "name": "The College of St. Scholastica", "description": "St. Scholastica is an independent private college with locations across Minnesota, including our original campus in Duluth, plus a brand new presence in Arizona through the Communiversity at Surprise. Enrollment in our undergraduate and graduate programs has grown from 2,200 to 4,000 in the last decade, due, in part, to our commitment to making high-quality education available online and through convenient evening and weekend formats.More info here."}, {"link": "https://www.mooc-list.com/university-entity/princeton-university", "name": "Princeton University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/luiss-universit%C3%A0-guido-carli", "name": "LUISS Università Guido Carli", "description": "LUISS – Libera Università Internazionale degli Studi Sociali Guido Carli, or the Guido Carli Free International University for Social Studies – is an independent university. It was created out of a pre-existing Roman institution, Pro Deo, between 1974 and 1978.More info here."}, {"link": "https://www.mooc-list.com/university-entity/national-taiwan-university", "name": "National Taiwan University", "description": "NTU's institutional predecessor was Taihoku Imperial University, founded in 1928 by the Japanese colonial administration. The first president was Shidehara Tan Tairaka Hiroshi. In 1945, the Republic of China won the war of resistance against Japan, and Taiwan was handed over to the Nationalist government of China. On November 15 of that year, Taihoku Imperial University was formally transferred to Chinese administration and renamed as National Taiwan University, with Dr. Tsung-lo Lo appointed as the first President.During the Japanese occupation, the University consisted of two academic divisions: the Literature and Politics division and the Science and Agriculture division, with about 60 students enrolled each semester. The Medical division was added in 1936, followed by the Engineering division in 1943. Additionally, the University included the affiliated Agriculture and Forestry division, the affiliated Medical special division, a Tropical Medicine research institute and a preparatory school. Also, in 1943 the Southern Humanities research institute and the Southern Resource research institute were added. At that time, each division operated according to the lecture system, with a full-time Professor in charge of a faculty of associate professors, lecturers, teaching assistants and staff. These divisions and institutes were financially independent and had their own libraries. By 1945, the university expanded to five divisions, including Literature and Politics, Science, Agriculture, Medicine and Engineering, with a total enrollment of 382 students.After restructuring in accordance with the ROC academic system in 1945, academic departments were established and the former divisions were renamed Colleges. The Literature and Politics division was divided into the College of Liberal Arts and the College of Law. Additionally, colleges of Science, Medicine, Engineering and Agriculture were established. Initially, there were six colleges with 22 departments. In 1945, student enrollment was 585. In the following years, the departments and colleges expanded in faculty and hardware in step with growing budgets and rising social expectations. In 1960, the night school was initiated on a trial basis, and in 1967 a new night school was established. In 1987, the College of Management was established, followed by the College of Public Health in 1993 and the College of Electrical Engineering in 1997. The College of Electrical Engineering was later rechristened the College of Computer Science and Electrical Engineering; in 1999, the College of Law was renamed the College of Social Sciences, and the Night Division and the Center for Continuing Education were combined to form the School for Professional and Continuing Studies. In 2002, the College of Agriculture was renamed the College of Bio-resources and Agriculture, and in 2002 a College of Life Sciences was added. Now, the university has 11 colleges, with 54 departments and 103 graduate institutes, plus four university-level research centers: Population and Gender Studies Center, Center for Condensed Matter Sciences, Center for Biotechnology, and Bio-diversity Research Center. The total number of students, including those enrolled at the School of Professional and Continuing Studies, has grown to over 33,000, including over 17,000 university students and 15,000 graduate students. Now, the number of graduate students at NTU almost equals the number of university students, which indicates that NTU has successfully been transformed into a research university.More info: http://www.ntu.edu.tw/engv4/"}, {"link": "https://www.mooc-list.com/university-entity/uc-san-diegox", "name": "UC San DiegoX", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/curtin-university", "name": "Curtin University", "description": "Curtin University is Western Australia’s largest and most culturally diverse university with Australia’s third largest international student population. With campuses in Malaysia and Singapore as well as face-to-face teaching in a number of countries, Curtin has a strong commitment to international engagement. This cultural diversity adds a rich and valuable dimension to our campus atmosphere, preparing all graduates to live and work effectively in an increasingly global environment.More info here."}, {"link": "https://www.mooc-list.com/university-entity/schoolkeep", "name": "SchoolKeep", "description": "The way we educate is evolving. Technology has opened the floodgates for educators who want to reach more students and improve learning outcomes. Motivated by this shift, SchoolKeep was founded to help them succeed in this new world.We’ve brought together the best of learning, commerce and site building services into one solution. Our users can build and brand their online schools, develop engaging courses and enroll students anywhere in the world - without ever leaving the platform.We built this with every educator in mind, from independent educators to academic institutions and corporations. The goal is to help them grow with a powerful and intuitive platform."}, {"link": "https://www.mooc-list.com/university-entity/university-toronto", "name": "University of Toronto", "description": "Established in 1827, the University of Toronto has one of the strongest research and teaching faculties in North America, presenting top students at all levels with an intellectual environment unmatched in depth and breadth on any other Canadian campus.More info here."}, {"link": "https://www.mooc-list.com/university-entity/cancer-research-uk", "name": "Cancer Research UK", "description": "Cancer Research UK are the world’s leading cancer charity dedicated to saving lives through research. Their ground-breaking work into the prevention, diagnosis and treatment of cancer has seen survival rates double in the last 40 years. Cancer Research UK’s scientists and doctors have contributed to most of the world’s top cancer drugs and have pioneered the use of radiotherapy to treat cancer.In addition to research, Cancer Research UK help millions of people access the information they need to understand cancer. They campaign on key cancer issues and run awareness initiatives to increase early detection and help people to reduce their risk of cancer. The charity receives no government funding for its life-saving research, meaning every step it takes towards beating cancer relies on every pound donated. Together with its partners and supporters, Cancer Research UK’s vision is to bring forward the day when all cancers are cured.More info here."}, {"link": "https://www.mooc-list.com/university-entity/rutgers-university", "name": "Rutgers University", "description": "Rutgers, The State University of New Jersey, is a leading national research university and the state’s preeminent, comprehensive public institution of higher education. Rutgers is dedicated to teaching that meets the highest standards of excellence; to conducting research that breaks new ground; and to providing services, solutions, and clinical care that help individuals and the local, national, and global communities where they live.Founded in 1766, Rutgers teaches across the full educational spectrum: preschool to precollege; undergraduate to graduate; postdoctoral fellowships to residencies; and continuing education for professional and personal advancement.More info: http://www.rutgers.edu/"}, {"link": "https://www.mooc-list.com/university-entity/technical-university-munich-tum", "name": "Technical University of Munich (TUM)", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/norwich-university-arts-nua", "name": "Norwich University of the Arts (NUA)", "description": "Norwich University of the Arts is a dynamic and creative community providing arts, design and media education.Norwich University of the Arts (NUA) is an independent specialist arts, design and media University with a 170 year reputation for excellence.NUA is dedicated to providing vocational, practice based courses which allow students to enter an exciting and challenging community of artists, designers and makers who share their passions and interests. Whilst the institution’s history can be traced back to 1845, it is contemporary and forward thinking with industry standard facilities in its city centre campus.Today NUA continues to thrive as an established University sector institution, with a national reputation for excellence and a strong ethos as a creative academic community. NUA mission statementNUA’s mission is to be the best specialist university for arts, design and media study in Europe, producing graduates of the highest quality and inspiring students and staff to achieve excellence in the creative and cultural spheres.More info here."}, {"link": "https://www.mooc-list.com/university-entity/udacity", "name": "Udacity", "description": "Udacity is where lifelong learners come to learn the skills they need, to land the jobs they want, to build the lives they deserve."}, {"link": "https://www.mooc-list.com/university-entity/university-system-maryland-usm", "name": "University System of Maryland (USM)", "description": "The University System of Maryland (USM) is the state of Maryland’s public higher education system. Benefiting students, as well as Maryland and its citizens, USM: Offers expansive access to affordable, high-quality educational opportunities; Performs groundbreaking research; Instills a culture of innovation and entrepreneurship; Promotes economic growth and workforce development; Provides vital services to communities and individuals; And partners with business, governments, nonprofits, and other organizations to improve quality of life.The USM consists of three Research Universities, three Historically Black Institutions, four Traditional Comprehensive Institutions, two Regional Education Centers; one Specialized Research institution, and one “Virtual” Institution specializing in online and distance education, and a system office.USM's programs and activities have a significant impact on the quality of life in Maryland, creating social and economic benefits for people throughout the state and beyond. USM is a recognized leader in many areas, including online learning, course redesign, and other components of academic innovation.The mission of the University System of Maryland is to improve the quality of life for the people of Maryland by providing a comprehensive range of high quality, accessible, and affordable educational opportunities; engaging in research and scholarship that expand the boundaries of current knowledge; and providing knowledge-based programs and services that are responsive to the needs of the citizens of the state and the nation. USM fulfills its mission through the effective and efficient management of its resources and the focused missions and activities of each of its component institutions.The vision of USM is to be a preeminent system of public higher education, admired around the world for its leadership in promoting and supporting education at all levels, fostering the discovery and dissemination of knowledge for the benefit of the state and nation, and instilling in all members of its community a respect for learning, diversity, and service to others.More info here"}, {"link": "https://www.mooc-list.com/university-entity/escp-europe", "name": "ESCP Europe", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-texas-arlington", "name": "University of Texas at Arlington", "description": "The University of Texas at Arlington is one of the nation’s most dynamic centers of higher learning, setting the standard for educational excellence in the thriving North Texas region it calls home. An academic centerpiece in the heart of the Dallas-Fort Worth Metroplex for nearly 120 years, UT Arlington was founded in 1895 as a private liberal arts institution. The University has evolved through a succession of names and missions, achieving senior college status in 1959 and becoming part of The University of Texas System in 1965.UT Arlington is rising in stature through its commitment to life-enhancing discovery, innovative teaching, and community engagement. With an enrollment of more than 38,000 students and a flourishing research enterprise, the University is a major contributor to the intellectual and economic advancement of the region, state and nation.More info here."}, {"link": "https://www.mooc-list.com/university-entity/funda%C3%A7%C3%A3o-lemann", "name": "Fundação Lemann", "description": "A Fundação Lemann é uma organização sem fins lucrativos, criada em 2002 pelo empresário Jorge Paulo Lemann. Contribuir para melhorar a qualidade do aprendizado dos alunos brasileiros e formar uma rede de líderes transformadores são os grandes objetivos da instituição. Para cumprir essa missão, a Fundação aposta em uma estratégia que envolve quatro áreas complementares de atuação: inovação, gestão, políticas educacionais e talentos.More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-california-irvine", "name": "University of California, Irvine", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/pwc", "name": "PwC", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/universit%C3%A9-catholique-de-louvain-ucl", "name": "Université Catholique de Louvain (UCL)", "description": "The Université catholique de Louvain (UCL), founded in 1425, is one of Europe’s oldest universities. The university has more than 28,000 students from bachelor’s level to doctorate and adult continuing education, in all disciplines. With its main campus located in Louvain-la-Neuve, next to Brussels, the university attracts every year 5,000 international students from more than 120 countries. UCL is ranked first among Belgium’s French-speaking universities (QS World University Ranking).More info here."}, {"link": "https://www.mooc-list.com/university-entity/ricex", "name": "RiceX", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/shoreline-community-college", "name": "Shoreline Community College", "description": "Founded in 1964 with land acquired with help from the Boeing family, Shoreline Community College offers more than a hundred excellent academic, professional/technical and workforce training programs to meet the lifelong learning needs of its community. Dedicated faculty and staff are committed to the educational success of all students.More info: http://www.shoreline.edu/"}, {"link": "https://www.mooc-list.com/university-entity/state-university-new-york", "name": "State University of New York", "description": "The State University of New York is the largest comprehensive university system in the United States. Our impact in New York State and across the globe begins with our 64 institutions, including research universities, academic medical centers, liberal arts colleges, community colleges, colleges of technology and an online learning network. We educate approximately 463,000 students in more than 7,500 degree and certificate programs, and nearly 2 million in workforce and professional development programs. Our nearly 3 million SUNY alumni are located around the globe, each making their own unique impact.More info here."}, {"link": "https://www.mooc-list.com/university-entity/taipei-medical-university", "name": "Taipei Medical University", "description": "Taipei Medical University (TMU), 600 meters away from the world’s tallest green building - Taipei 101 building, has been a leader in Taiwan’s healthcare system for more than half a century due to its research, teaching excellence, internationalization and outstanding medical service. TMU has seven colleges including College of Medicine, College of Oral Medicine, College of Pharmacy, College of Public Health and Nutrition, College of Nursing, College of Medical Science and Technology and College of Humanities and Social Sciences and owns three Joint Commission International (JCI)-accredited hospitals with a total capacity of over 3,100 beds. TMU and its three JCI hospitals are the largest and one of the best healthcare systems in the Taipei Metropolitan Area.TMU leads in quite a few research areas including Cancer, Translational Medicine, Neuroregenerative Medicine, Biomedical Devices and Tissue Engineering, Reproductive Medicine and Biomedical Informatics. TMU has several top-notch research centers such as Center of Excellence for Cancer Research, Center of Excellence for Clinical Trial and Research in Neuroscience, Center of Excellence for Stroke Research, Center of Excellence for Biomedical Implants and Microsurgery Devices. TMU collaborates with many international prestigious universities and institutes on cancer, neurotrauma, nanotechnology and 3D printing research such as National Institutes of Health, Johns Hopkins University, University of Southampton, University of Dundee, University of Liverpool, Aarhus University, University of Washington, University of Tokyo, Academia Sinica, and National Health Research Institutes.TMU’s commitment to internationalisation has resulted in 36,000 alumni improving healthcare systems in over100 countries around the world. More than 5,500 students from over 31 countries are enrolled in TMU’s seven colleges, and most master’s degree and doctoral programs offer instruction in English. The permanent appointment of the university’s medical teams to assist two African nations (Swaziland and Sao Tome and Principe) provides opportunities for service and learning as well as enhancing Taiwan’s health diplomacy.More info here."}, {"link": "https://www.mooc-list.com/university-entity/american-bls", "name": "American BLS", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/karlstad-business-school", "name": "Karlstad Business School", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-nottingham", "name": "The University of Nottingham", "description": "The University of Nottingham is committed to providing a truly international education, inspiring students, producing world-leading research and benefiting the communities around campuses in the UK, China and Malaysia. The purpose of the University is to improve life for individuals and societies worldwide. By bold innovation and excellence in all that it does, the University makes both knowledge and discoveries matter.The University of Nottingham has 42,000 students at award-winning campuses in the United Kingdom, China and Malaysia. It was ‘one of the first to embrace a truly international approach to higher education’, according to the Sunday Times University Guide 2013. It is also one of the most popular universities among graduate employers, one of the world’s greenest universities, and winner of the Times Higher Education Award for ‘Outstanding Contribution to Sustainable Development’. It is ranked in the UK’s Top 10 and the World’s Top 75 universities by the Shanghai Jiao Tong and the QS World Rankings.More than 90 per cent of research at The University of Nottingham is of international quality, according to the most recent Research Assessment Exercise. The University aims to be recognised around the world for its signature contributions, especially in global food security, energy & sustainability, and health. It won a Queen’s Anniversary Prize for Higher and Further Education for its research into global food security.More info: http://www.nottingham.ac.uk/"}, {"link": "https://www.mooc-list.com/university-entity/google", "name": "Google", "description": "A missão da Google é organizar a informação do mundo e torná-la universalmente acessível e útil.More info: www.google.com"}, {"link": "https://www.mooc-list.com/university-entity/mit", "name": "MIT", "description": "The mission of MIT is to advance knowledge and educate students in science, technology, and other areas of scholarship that will best serve the nation and the world in the 21st century.The Institute is committed to generating, disseminating, and preserving knowledge, and to working with others to bring this knowledge to bear on the world's great challenges. MIT is dedicated to providing its students with an education that combines rigorous academic study and the excitement of discovery with the support and intellectual stimulation of a diverse campus community. We seek to develop in each member of the MIT community the ability and passion to work wisely, creatively, and effectively for the betterment of humankind.More info here."}, {"link": "https://www.mooc-list.com/university-entity/yale-divinity-school", "name": "Yale Divinity School", "description": "More info: http://divinity.yale.edu/"}, {"link": "https://www.mooc-list.com/university-entity/hkpolyux", "name": "HKPolyUx", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/investoocom", "name": "Investoo.com", "description": "Launched in 2013, Investoo.com is the biggest free online trading school on the internet. Our video courses teach a range of subjects including Forex, MT4 Tutorials, Binary Options Strategies, Advanced Technical Analysis and Price Action Strategies."}, {"link": "https://www.mooc-list.com/university-entity/yale-university", "name": "Yale University", "description": "Yale University comprises three major academic components: Yale College (the undergraduate program), the Graduate School of Arts and Sciences, and the professional schools. In addition, Yale encompasses a wide array of centers and programs, libraries, museums, and administrative support offices. Approximately 11,250 students attend Yale.More info: http://www.yale.edu/"}, {"link": "https://www.mooc-list.com/university-entity/columbia-university", "name": "Columbia University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/uqx", "name": "UQx", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/uniseb", "name": "UniSEB", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/universitat-polit%C3%A8cnica-de-val%C3%A8ncia", "name": "Universitat Politècnica de València", "description": "The website of the Universitat Politècnica de València is much more than the cover letter of our institution. It is an especially effective working tool and an essential aid for students. Its portals provide high quality information and a wide range of services, which are accessible from a variety of mobile devices. The result is an intuitive and functional web, universal and direct, the best reflection of what we, as a university, want to be.More info here."}, {"link": "https://www.mooc-list.com/university-entity/ieee", "name": "IEEE", "description": "IEEE is the world's largest professional organization dedicated to advancing technological innovation and excellence for the benefit of humanity. IEEE and its members inspire a global community through IEEE's highly cited publications, conferences, technology standards, and professional and educational activities.More info here."}, {"link": "https://www.mooc-list.com/university-entity/ucl-institute-education", "name": "UCL Institute of Education", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/georgetown-university", "name": "Georgetown University", "description": "Georgetown University, the nation’s oldest Catholic and Jesuit university, is one of the world’s leading academic and research institutions, offering a unique educational experience that prepares the next generation of global citizens to lead and make a difference in the world. Students receive a world-class learning experience focused on educating the whole person through exposure to different faiths, cultures and beliefs.More info here."}, {"link": "https://www.mooc-list.com/university-entity/copenhagen-business-school", "name": "Copenhagen Business School", "description": "CBS creates knowledge at many levels; to students, academia and society. You can read more about how CBS offers knowledge. CBS establishes continuously focus areas and platforms based on CBS 'strategy, makes experts available in their fields and disseminates knowledge through teaching, training, videos and the use of social media.More info: http://www.cbs.dk/"}, {"link": "https://www.mooc-list.com/university-entity/university-california-davis", "name": "University of California, Davis", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/sciences-po", "name": "Sciences Po", "description": "Sciences Po is a selective and diverse French university specialising in the humanities and social sciences. It devotes 40% of its budget to research.More info here."}, {"link": "https://www.mooc-list.com/university-entity/boston-university", "name": "Boston University", "description": "Boston University is no small operation. With over 33,000 undergraduate and graduate students from more than 140 countries, 10,000 faculty and staff, 16 schools and colleges, and 250 fields of study, our two campuses are always humming, always in high gear.More info here."}, {"link": "https://www.mooc-list.com/university-entity/smartly", "name": "Smartly", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/inter-american-development-bank-idb", "name": "Inter-American Development Bank (IDB)", "description": "The Inter-American Development Bank (IDB) is the leading source of development financing for Latin America and the Caribbean. It supports efforts to reduce poverty and inequality, and is strongly committed to achieving measurable results, increased integrity, transparency and accountability. Founded in 1959, the IDB provides loans, grants, technical assistance and does research and training. Its shareholders are 48 member countries, including 26 borrowing member countries. The Bank is headquartered in Washington, DC.The IDB is committed to sharing knowledge on economic and social development topics by offering highly rated online and face-to-face courses as well as open educational resources. It has also developed a series of Massive Open Online Course (MOOCs), available at BIDX. The list of available courses, some of which are being developed in partnership with leading universities, will continue to grow over time.More info here."}, {"link": "https://www.mooc-list.com/university-entity/kyotoux", "name": "KyotoUx", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/kyoto-university", "name": "Kyoto University", "description": "Founded in 1897, Kyoto University is acknowledged as one of the most accomplished research-oriented universities in Asia. The validity of that reputation is testified by the accolades conferred on our alumni researchers, most notably eight Nobel Prize laureates who undertook vital research during their time at the university. In addition to those awards, several other Kyoto University faculty members have received respected accolades, including two Fields Medalists and one recipient of the Gauss Prize.More info here."}, {"link": "https://www.mooc-list.com/university-entity/berkleex", "name": "BerkleeX", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/new-york-university-tandon-school-engineering", "name": "New York University Tandon School of Engineering", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/barcelona-world-race-ocean-campus", "name": "Barcelona World Race Ocean Campus", "description": "Set up by the FNOB, the University of Barcelona and the El Far Consortium, the Barcelona World Race Ocean Campus is a platform of open educational courses based on subjects in the fields of science, the humanities and technology, as they are developed and applied through the Barcelona World Race (BWR): the first and only double-handed, non-stop, round the world regatta. This initiative has been brought to life thanks to an agreement signed in April 2013 by the three institutions, establishing a commitment to collaborate, disseminate knowledge of, and boost the educational and training potential of the BWR.More info here."}, {"link": "https://www.mooc-list.com/university-entity/centre-national-de-la-fonction-publique-territoriale-cnfpt", "name": "Centre National de la Fonction Publique Territoriale (CNFPT)", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/emory-university", "name": "Emory University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/microsoft", "name": "Microsoft", "description": "We live in a mobile-first and cloud-first world. Computing is ubiquitous, and experiences span devices and exhibit ambient intelligence. Billions of sensors, screens and devices – in conference rooms, living rooms, cities, cars, phones, PCs – are forming a vast network and streams of data that simply disappear into the background of our lives. This computing power will digitize nearly everything around us, and will derive insights from all of the data being generated by interactions among people and between people and machines. We are moving from a world where computing power was scarce to a place where it now is almost limitless, and where the true scarce commodity is increasingly human attention.In this new connected world, we believe technology creates opportunity, and our edX courses are designed to provide you with the core development skills needed to be successful in the cloud-first, mobile-first world."}, {"link": "https://www.mooc-list.com/university-entity/universidad-rey-juan-carlos", "name": "Universidad Rey Juan Carlos", "description": "More info: http://www.urjc.es/"}, {"link": "https://www.mooc-list.com/university-entity/uc3mx", "name": "UC3Mx", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/ie-business-school", "name": "IE Business School", "description": "IE is an international institution dedicated to educating business leaders through programs based on our core values of global focus, entrepreneurial spirit and a humanistic approach. Our 500-strong, international faculty teaches a student body composed of more than 90 nationalities in our Undergraduate (IE University), Master, and Doctorate degrees, and Executive Education programs. Our alumni, now numbering over 40,000, hold management positions in some 100 countries worldwide.More info here."}, {"link": "https://www.mooc-list.com/university-entity/socialcops-academy", "name": "SocialCops Academy", "description": "SocialCops is a data intelligence company. We partner with leaders and organizations around the world to make data-driven decisions easier and more effective.Our platform brings the entire decision-making process to one place — from collecting primary data, accessing secondary data, and merging internal data to visualising data via easy-to-use dashboards. Our platform has been used in various settings - we work with the Ministry of Petroleum to pinpoint exact locations to open 10000 LPG Centers across India to maximise profitability and track 50 million beneficiaries, for strategic investments by Gates Foundation & Unilever to real time monitoring & tracking by Niti Aayog, BASF, World Bank etc.With our data intelligence platform, we have enabled collection of over 250 million primary data points and aggregated over 600 data sources.More info here."}, {"link": "https://www.mooc-list.com/university-entity/shaping-tomorrow", "name": "Shaping Tomorrow", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/universit%C3%A9-lille-1", "name": "Université Lille 1", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/esri", "name": "Esri", "description": "We were founded to help solve some of the world’s largest problems. From natural disasters to humanitarian crisis, the important work our users do will always be the focus of what we do."}, {"link": "https://www.mooc-list.com/university-entity/university-california-san-diego", "name": "University of California, San Diego", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/virtual-euniversity", "name": "Virtual eUniversity", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/unow", "name": "Unow", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/wageningen-university", "name": "Wageningen University", "description": "Wageningen UR is a collaboration between Wageningen University and the DLO foundation.More info here."}, {"link": "https://www.mooc-list.com/university-entity/ens-cachan", "name": "ENS Cachan", "description": "The Ecole normale supérieure de Cachan (the ENS Cachan), a prestigious public institution of higher education and research founded in 1912, is one of the major French Grandes Écoles, which are considered the pinnacle of French higher education.More info here."}, {"link": "https://www.mooc-list.com/university-entity/pontif%C3%ADcia-universidade-cat%C3%B3lica-do-rio-grande-do-sul", "name": "Pontifícia Universidade Católica do Rio Grande do Sul", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/caresearch", "name": "CareSearch", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/rmit-university", "name": "RMIT University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/duke-university", "name": "Duke University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-college-dublin", "name": "University College Dublin", "description": "University College Dublin has its origins in the mid-nineteenth century under the leadership of the renowned educationalist John Henry Cardinal Newman. Since its foundation in 1854, the University has flourished and made a unique and substantial contribution to the creation of modern Ireland, based on successful engagement with Irish society on every level and across every sphere of activity.UCD is one of Europe’s leading research-intensive universities; an environment where undergraduate education, masters and PhD training, research, innovation and community engagement form a dynamic spectrum of activity.The international standing of UCD has grown in recent years; it is currently ranked within the top 1% of institutions world-wide. UCD is also Ireland’s most globally engaged university with over 30,000 students drawn from over 120 countries, and includes 5,500 students based at locations outside of Ireland. The University’s main Dublin campus occupies an extensive parkland estate of more than 130 hectares and offers world-leading facilities including the UCD O’Brien Centre for Science, UCD Sutherland School of Law, UCD Lochlan Quinn School of Business and UCD Student Centre.The spectrum of research and innovation at UCD encompasses individual scholars, small, medium and large research groups, start-up companies and large-scale collaborations with industry and other partners. Research is conducted within each of the University’s extensive range of disciplines, and in multidisciplinary research programmes addressing challenges of global scale.UCD is Ireland’s University of first choice, leading in first-preference applications in Ireland year after year; as well as being the university of first choice for international students coming to Ireland. UCD is globally recognised for its excellence in teaching and learning.UCD students and worldwide network of 224,000 graduates benefit from a UCD education that enables them to thrive and contribute in an increasingly global community.More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-washington", "name": "University of Washington", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/mca-business-postgraduate-school", "name": "MCA Business & Postgraduate School", "description": "MCA Business and Postgraduate School es una institución de educación continua y posgrados, y surge como alternativa para la superación de estudiantes y profesionales que reconozcan la modalidad online como opción a su crecimiento profesional y personal. Nuestros programas de estudios se basan en la excelencia educativa, integrando componentes de aprendizajes profundos, para una formación de calidad.Nos preocupamos por la superación profesional y la formación en los países de habla hispana. Nuestro equipo de profesionales y académicos se adaptan a las necesidades de nuestros estudiantes, lo que posibilita un sistema de enseñanza aprendizaje personalizado."}, {"link": "https://www.mooc-list.com/university-entity/bux", "name": "BUx", "description": "Boston University’s impact extends far beyond our campus in the heart of Boston. Our students, faculty, and alumni travel around the globe to study, teach, and become immersed in the communities in which they live. As one of the world’s leading research universities, Boston University is currently engaged in more than 340 separate research, service, and educational programs and projects. Today, BU is the fourth-largest private university in the country and a member of the American Association of Universities, a nonprofit association of 62 of North America’s leading research-intensive institutions.With 16 schools and colleges BU offers our students more than 250 programs of study in science and engineering, social science and humanities, health science, the arts, and other professional disciplines. And after graduation? Our students take their place in a long line of alumni whose inclusive and engaged educational experience prepared them to help serve, shape, and improve the world.More info: http://www.bu.edu/"}, {"link": "https://www.mooc-list.com/university-entity/georgetownx", "name": "GeorgetownX", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/universit%C3%A9-de-valenciennes-et-du-hainaut-cambr%C3%A9sis", "name": "Université de Valenciennes et du Hainaut-Cambrésis", "description": "L'Université de Valenciennes et du Hainaut-Cambrésis est un établissement pluridisciplinaire hors santé qui accueille près de 11 000 étudiants sur des campus à taille humaine à Valenciennes, Cambrai, Maubeuge et Arenberg.Elle donne la possibilité de se former à un métier en proposant plus de 180 parcours de formations professionnalisants du bac 2 + au bac 8 et elle accueille des publics en formation initiale, en formation continue et parmi les toutes premières en nombre d’étudiants suivant un cursus par alternance.Elle est reconnue comme l'un des principaux acteurs de la recherche au niveau régional dans le domaine du transport et de la mobilité durables.3 axes stratégiques viennent en complément de cet axe de recherche majeur :- Images et Créations Numériques,- Ingénierie de la santé et du handicap,- Sécurité et maîtrise des risques.More info here."}, {"link": "https://www.mooc-list.com/university-entity/aquent", "name": "Aquent", "description": "More info: http://www.aquent.com/"}, {"link": "https://www.mooc-list.com/university-entity/tsinghua-university", "name": "Tsinghua University", "description": "Tsinghua University, founded in 1911, is one of the most prestigious universities in Asia. Tsinghua University consists of 19 schools and 55 departments with faculties in science, engineering, humanities, social sciences, architecture, management, law, medicine, arts and design. As China’s leading institution of advanced learning, Tsinghua is dedicated to excellence in education, research, and social services. Tsinghua has approximately 3,200 faculty members and over 35,000 students, including 3,500 international students from 108 countries. Among its 170,000 alumni are many outstanding scholars, successful entrepreneurs, and distinguished statesmen who have been playing important roles in the development of China.More info here."}, {"link": "https://www.mooc-list.com/university-entity/california-college-arts", "name": "California College of the Arts", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/avans-hogeschool", "name": "Avans Hogeschool", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-zurich", "name": "University of Zurich", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/mcgill", "name": "McGill", "description": "Founded in Montreal, Quebec, in 1821, McGill is a leading Canadian post-secondary institution. It has two campuses, 11 Faculties, 11 professional schools, 300 programs of study and some 39,000 students, including more than 9,300 graduate students. McGill attracts students from over 150 countries around the world, its 8,200 international students making up 21 per cent of the student body. Almost half of McGill students claim a first language other than English, including approximately 40 per cent whose first language is French or who speak it fluently.More info here."}, {"link": "https://www.mooc-list.com/university-entity/4-h-youth-development", "name": "4-H Youth Development", "description": "4-H is dedicated to learning and understanding how its programs help youth become responsible citizens leading healthy and productive lives and discovering critical science-focused innovations.More info: http://www.4-h.org/"}, {"link": "https://www.mooc-list.com/university-entity/essec-business-school", "name": "ESSEC Business School", "description": "Institution académique d’excellence créée en 1907, ESSEC BUSINESS SCHOOL s’est, tout au long de son histoire, illustrée par son esprit pionnier, partagé par la communauté de ses 46 000 diplômés. Aujourd’hui, l’ESSEC propose à Cergy-Pontoise, Paris-La Défense et Singapour une large gamme de programmes, en formation initiale et continue, irrigués par une recherche de pointe. Marquée par une profonde tradition humaniste, l’ESSEC a fait du lien entre vie économique et société un enjeu fondamental de la formation de managers responsables. Par là-même, l’ESSEC affirme la nécessité de mettre l’innovation, le savoir et la création de valeur au service de l’intérêt général.More info: http://www.essec.fr/"}, {"link": "https://www.mooc-list.com/university-entity/iimbx", "name": "IIMBx", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/harvard-university", "name": "Harvard University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/universidad-complutense-de-madrid", "name": "Universidad Complutense de Madrid", "description": "More info: http://www.ucm.es/"}, {"link": "https://www.mooc-list.com/university-entity/universidade-federal-do-cear%C3%A1-ufc", "name": "Universidade Federal do Ceará (UFC)", "description": "More info: http://www.ufc.br/"}, {"link": "https://www.mooc-list.com/university-entity/instituto-tecnol%C3%B3gico-de-aeron%C3%A1utica", "name": "Instituto Tecnológico de Aeronáutica", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/open2study", "name": "Open2Study", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/stanford-university", "name": "Stanford University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-california-berkeley", "name": "University of California, Berkeley", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/ens-de-lyon", "name": "ENS de Lyon", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/institute-housing-and-urban-development", "name": "Institute for Housing and Urban Development", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/ritx", "name": "RITx", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/galileo-university", "name": "Galileo University", "description": " Located in Guatemala, Galileo University is a higher education institution, the product of 38 years of constant work and effort of an elite group of academics and professionals, lead by Eduardo Suger Cofiño, Ph.D., founder and President. He has been able to put forward a completely innovative and non-traditional educational approach that Galileo calls “The revolution of education,” which is also impelled by very a clear motto: “To educate is to change visions and transform lives.\" With thirty-eight years of successful experience, facing the rapid-changing times and the knowledge globalization, Galileo University has positioned itself as a relevant leader and a reference in the field of technology. This gives the University a very important role, not only in professional training, but also in the generation of knowledge, that responds to the needs of an increasingly competitive world, becoming an excellent choice for the education of the Guatemalan and Latin American new generations. Galileo has experienced significant growth during the past few years, this has been regarded as extraordinary. This growth has not only been in the number of students, but also in the number of offered programs, research lines, publications, joint programs with government institutions and corporate organizations, and international projects with the objective to contribute to the development of Higher education. MOOC's pioneer in Latin America, which aims to give all people access to high quality academic courses developed by an interdisciplinary team of researchers, bringing together worldwide academics and students; all this has made of Galileo one of the most important universities in the Central and Latin American region. All this is a direct result of a clear vision and a firm commitment to it."}, {"link": "https://www.mooc-list.com/university-entity/pennsylvania-state-university", "name": "Pennsylvania State University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/%C3%A9cole-polytechnique-f%C3%A9d%C3%A9rale-de-lausanne", "name": "École Polytechnique Fédérale de Lausanne", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/universidade-de-s%C3%A3o-paulo-brasil", "name": "Universidade de São Paulo, Brasil", "description": "More info: http://www5.usp.br/"}, {"link": "https://www.mooc-list.com/university-entity/giz-global-campus-21", "name": "GIZ - Global Campus 21", "description": "Gesellschaft für Internationale Zusammenarbeit (GIZ) GmbH"}, {"link": "https://www.mooc-list.com/university-entity/university-virginia", "name": "University of Virginia", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/novoed", "name": "NovoEd", "description": "More info: https://novoed.com/"}, {"link": "https://www.mooc-list.com/university-entity/universiteit-leiden", "name": "Universiteit Leiden", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/universidad-polit%C3%A9cnica-de-madrid", "name": "Universidad Politécnica de Madrid", "description": "La Universidad Politécnica de Madrid (UPM) se fundó en 1971 con la integración de las Escuelas Técnicas Superiores. Cuenta con un doble sello de Campus de Excelencia Internacional, una distinción que refrenda la calidad de su actividad docente e investigadora.More info here."}, {"link": "https://www.mooc-list.com/university-entity/indian-school-business-isb", "name": "Indian School of Business (ISB)", "description": "The Indian School of Business (ISB) evolved from the need for a world-class business school in Asia. The founders, some of the best minds from the corporate and academic worlds, anticipated the leadership needs of the emerging Asian economies.More info here."}, {"link": "https://www.mooc-list.com/university-entity/commonwealth-education-trust", "name": "Commonwealth Education Trust", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-leicester", "name": "University of Leicester", "description": "The University of Leicester is a leading research led university based in Leicester, England.The University of Leicester is a leading research led university with a strong tradition of excellence in teaching. It was named University of the Year of 2008 by the Times Higher Education when the judges described Leicester as “elite without being elitist.” Leicester is consistently ranked amongst the top 20 universities in the United Kingdom. The University is most famous for the invention of Genetic Fingerprinting and for the discovery of the remains of King Richard III.More info: http://www.le.ac.uk/"}, {"link": "https://www.mooc-list.com/university-entity/university-chicago", "name": "The University of Chicago", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-alberta", "name": "University of Alberta", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-michigan", "name": "University of Michigan", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/hong-kong-university-science-and-technology", "name": "The Hong Kong University of Science and Technology", "description": "The Hong Kong University of Science and Technology (HKUST) is a world-class international research university excelling in science, technology and business as well as humanities and social science. Internationally renowned for its academic rigor and accomplishments, the University promotes interdisciplinary studies and provides holistic education, nurturing well-rounded graduates with a strong entrepreneurial spirit, innovative thinking and relevant skills to thrive in a knowledge economy. As an international university with strong ties to global thought leaders, HKUST has wide-ranging connections with Mainland China while aspiring to be a global premier knowledge hub and a center of research breakthroughs. HKUST was ranked Asia's number one for the second year in a row in QS Asian University Rankings 2011 and 2012. It was placed third for the world's under-50 universities in 2012. The Kellogg-HKUST Executive MBA (EMBA) program, for the fourth straight year, topped the Financial Times EMBA global rankings.More info here."}, {"link": "https://www.mooc-list.com/university-entity/arizona-state-university", "name": "Arizona State University", "description": "Arizona State University has developed a new model for the American Research University, creating an institution that is committed to excellence, access and impact. ASU measures itself by those it includes, not by those it excludes. ASU pursues research that contributes to the public good, and ASU assumes major responsibility for the economic, social and cultural vitality of the communities that surround it.More info here."}, {"link": "https://www.mooc-list.com/university-entity/opensecuritytraining", "name": "OpenSecurityTraining", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/universidad-de-los-andes", "name": "Universidad de los Andes", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/cambridge-university-press", "name": "Cambridge University Press", "description": "Cambridge University Press publishes inspiring and high quality resources for schools all around the world.Brighter Thinking drives their approach. Every day they talk to teachers and leading educational thinkers in Cambridge and around the world about how to make teaching and learning better. They share teachers’ ambitions to prepare students for success in life, both academically and personally.This rich insight and common goal informs the development of every new educational resource they publish. It makes Better Learning possible, enabling students to accelerate their learning and develop skills for life."}, {"link": "https://www.mooc-list.com/university-entity/mcmaster-university", "name": "McMaster University", "description": "Founded in 1887, McMaster University is committed to creativity, innovation, and excellence by inspiring critical thinking, personal growth, and a passion for learning. Ranked amongst the Top 100 universities in the world, McMaster pioneered a learner-centred, problem-based, interdisciplinary approach to learning that is now known worldwide as the “McMaster Model”.More info: http://www.mcmaster.ca/"}, {"link": "https://www.mooc-list.com/university-entity/queensland-university-technology", "name": "Queensland University of Technology", "description": "We are a highly successful Australian university with an applied emphasis in courses and research. While we're based in Brisbane, Queensland, we have a global outlook.More info here."}, {"link": "https://www.mooc-list.com/university-entity/chartered-institute-building-academy", "name": "Chartered Institute of Building Academy", "description": "The CIOB Academy is built to take action to overcome some of the construction Industry’s greatest challenges. We’re here to future-proof your company’s greatest assets: your people, delivering training, the right knowledge and ‘real world’ skills, at all levels.Working with industry and for industry, CIOB helps support your employees on their development paths and make sure your company meets industry demands now and in the future.More info here."}, {"link": "https://www.mooc-list.com/university-entity/colorado-state-university-online", "name": "Colorado State University Online", "description": "Colorado State University is an accredited public university in Fort Collins offering more than 70 online degree programs and graduate certificates. In order to deliver greater access to educational opportunities, CSU also offers several free Massive Online Open Courses on a variety of topic areas. CSU ranks 58th among public universities nationwide, according to U.S. News and World Report. CSU’s online M.B.A. program is ranked number 19 worldwide, according to the Financial Times. As of the 2017-18 academic year, ninety percent of CSU graduates seeking employment or education secured a job offer or their first destination plans within six months of graduation.More info here."}, {"link": "https://www.mooc-list.com/university-entity/goldsmiths-university-london", "name": "Goldsmiths, University of London", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/yandex", "name": "Yandex", "description": "Yandex is a technology company that builds intelligent products and services powered by machine learning. Our goal is to help consumers and businesses better navigate the online and offline world. Since 1997, we have delivered world-class, locally relevant search and information services. Additionally, we have developed market-leading on-demand transportation services, navigation products, and other mobile applications for millions of consumers across the globe. Yandex, which has 17 offices worldwide, has been listed on the NASDAQ since 2011.More info here."}, {"link": "https://www.mooc-list.com/university-entity/uned", "name": "UNED", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/universidade-estadual-de-campinas-unicamp", "name": "Universidade Estadual de Campinas (UNICAMP)", "description": "A Unicamp responde por 15% da pesquisa acadêmica no Brasil e mantém a liderança entre as universidades brasileiras no que diz respeito a patentes e ao número de artigos per capita publicados anualmente em revistas indexadas na base de dados ISI/WoS.A Unicamp é uma autarquia, autônoma em política educacional, mas subordinada ao Governo Estadual no que se refere a subsídios para a sua operação. Assim, os recursos financeiros são obtidos principalmente do Governo do Estado de São Paulo e de instituições nacionais e internacionais de fomento.More info here."}, {"link": "https://www.mooc-list.com/university-entity/chalmers-university-technology", "name": "Chalmers University of Technology", "description": "Chalmers University of Technology conducts research and offers education in technology, science, shipping and architecture with a sustainable future as our global vision. Chalmers is well-known for providing an effective environment for innovation and has eight priority areas of international significance – Built Environment, Energy, Information and Communication Technology, Life Science, Materials Science, Nanoscience and Nanotechnology, Production, and Transportation.International students have rated Chalmers learning as number 1 in Europe, in the International Student Barometer, stating very high satisfaction with the lecturers knowledge, course content and organization as key factors.Founded in 1829, and situated in Gothenburg, Sweden, Chalmers has 11,000 full-time students and 3,000 employees.More info here."}, {"link": "https://www.mooc-list.com/university-entity/instructor-made-course", "name": "Instructor Made Course", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/utarlingtonx", "name": "UTArlingtonX", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/imfx", "name": "IMFx", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/ferrandi-paris", "name": "FERRANDI Paris", "description": "L'École Française de Gastronomie.More info here."}, {"link": "https://www.mooc-list.com/university-entity/peking-university", "name": "Peking University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/wma", "name": "WMA", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/seoul-national-university", "name": "Seoul National University", "description": "Seoul National University, Korea’s first national university and the indisputable leader of higher education in Korea, wants to share creative knowledge and experiences. SNU has produced fruitful achievements in various fields, ranging from business, politics, natural science, technology, and the arts. The mission of SNU is to create a vibrant intellectual community where students and scholars join together in building the future.More info here."}, {"link": "https://www.mooc-list.com/university-entity/integlobal-gsbp", "name": "InteGlobal GSBP", "description": "InteGlobal is the sole provider of Australia’s only nationally recognised, ASQA accredited Post Graduate Lean Six Sigma qualifications.Created to ensure that high standards of Lean Six Sigma technical capability are taught and maintained, InteGlobal teaches genuine, full version Lean Six Sigma. With more than a decade of practice by LSS Master Black Belts, the quality of InteGlobal’s training and curriculum stands in stark contrast to the many short, cheap and incomplete courses on offer.Today, InteGlobal stands at the centre of a global network of world-class Lean Six Sigma consultancies and have the most experienced legitimate consulting and implementation resources in the Asia Pacific region. That means not only that you will be mentored by validated industry professionals charged with your success but that where ever you or your international operations may be, InteGlobal puts you in touch with a network of high calibre, like-minded people.More info here."}, {"link": "https://www.mooc-list.com/university-entity/danmarks-tekniske-universitet-dtu", "name": "Danmarks Tekniske Universitet (DTU)", "description": "More info: http://www.dtu.dk/"}, {"link": "https://www.mooc-list.com/university-entity/erasmus-university-rotterdam", "name": "Erasmus University Rotterdam", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/san-jose-state-university", "name": "San Jose State University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/other-entities", "name": "Other Entities", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-bristol", "name": "University of Bristol", "description": "More info: http://www.bris.ac.uk/"}, {"link": "https://www.mooc-list.com/university-entity/european-schoolnet", "name": "European Schoolnet", "description": "European Schoolnet is a network of 31 European Ministries of Education, based in Brussels, Belgium.As a not-for-profit organisation, we aim to bring innovation in teaching and learning to our key stakeholders:Ministries of Education, schools, teachers, researchers, and industry partners."}, {"link": "https://www.mooc-list.com/university-entity/galileox", "name": "GalileoX", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/national-university-singapore", "name": "National University of Singapore", "description": "A leading global university located in Asia, the National University of Singapore (NUS) is Singapore’s flagship university, and offers a global approach to education and research with a focus on Asian perspectives and expertise. Its transformative education includes a broad-based curriculum underscored by multi-disciplinary courses and cross-faculty enrichment.More info: http://www.nus.edu.sg/"}, {"link": "https://www.mooc-list.com/university-entity/montpellier-supagro", "name": "Montpellier SupAgro", "description": "Montpellier SupAgro, Institut national d’études supérieures agronomiques de Montpellier, forme des cadres pour l’agriculture, l’alimentation, et la gestion durable des ressources naturelles et des territoires. Ses missions dans ces domaines sont de :Dispenser des formations d’ingénieur ;Exercer des activités de formation initiale et continue, de recherche, de diffusion de connaissances, d’expertise et d’appui à l’innovation et à la création d’entreprise ;Exercer des missions d’appui à l’enseignement technique agricole ;Concourir à la coopération scientifique, technique et pédagogique internationale, en particulier avec les pays des zones méditerranéennes et tropicales.Installé dans un environnement de scientifique et de recherche exceptionnel, 1er rang mondial en agronomie, Montpellier SupAgro bénéficie de réseaux de professionnels et de partenaires à la pointe de la recherche et de l’innovation.Montpellier SupAgro est engagé vers l’évolution du numérique et reconnu pour ses prises d’initiatives dans le domaine de l’innovation pédagogique. Accompagné par le service « Ressources pédagogiques et numériques », les équipes enseignantes développent les usages du numérique au service de la formation.Montpellier SupAgro travaille avec la plateforme de FUN pour la diffusion de MOOCs. Les objectifs sont de proposer et de co-construire un ensemble de ressources libres et de parcours de formation pour le grand public.Ces cours en ligne ouverts à tous favorisent le développement de communautés actives. Ils participent au partage de connaissances avec les enseignants-chercheurs et les étudiants en formations initiales et tout au long de la vie.Retrouvez Montpellier SupAgro à travers nos MOOCs sur l’agroécologie, la taxonomie des arthropodes, la vigne et le vin.Montpellier SupAgro est membre de COMUE Languedoc-Roussillon Universités."}, {"link": "https://www.mooc-list.com/university-entity/university-british-columbia", "name": "The University of British Columbia", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/universit%C3%A9-de-lille-droit-et-sant%C3%A9", "name": "Université de Lille, Droit et Santé", "description": "La formation à l'Université de Lille, Droit et santé. L'Université offre à chaque étudiant une formation diversifiée, adossée à une recherche largement reconnue, à une politique ambitieuse d'ouverture à l'international et élaborée pour permettre l'accessibilité de tous à un projet et à une insertion professionnelle.La recherche à l'Université de Lille, Droit et santé. Compte tenu de ses champs de compétences, seule ou en lien avec ses partenaires, l'Université de Lille, Droit et Santé, à travers sa stratégie de recherche veut contribuer à l'ambition de répondre aux quatre défis sociétaux identifiés par l'Union Européenne: santé, changement démographique et bien être; sociétés innovantes, intégrantes et adoptives; sécurité alimentaire et bio économie; garantie de la liberté et de la sécurité de l'Europe de ses citoyens et de ses résidents.L'université de Lille, Droit et Santé a engagé une politique volontariste dans le domaine du Numérique.Nous sommes parmi les premiers a avoir proposé, de manière obligatoire en licence, une formation certifiante à la Culture Numérique au travers du C2i niveau 1. En 2020, 90% des métiers nécessiteront une solide Culture Numérique, nos étudiants intègrent d'ores et déjà ce paradigme.Un accompagnement a été mis en place pour tous les enseignants désireux de mettre en œuvre des usages et des outils numériques.Un financement important a été débloqué pour le développement de projets pédagogiques innovants et/ou numériques, en mettant l'accent sur le pilotage, l'évaluation des objectifs et la transférabilité disciplinaire et interdisciplinaire des projets.La création de MOOC est un volet de cette politique numérique, qui se veut exhaustive pour permettre l'éclosion de tous lesusages possibles du numérique dans les apprentissages.L’Université de Lille Droit et Santé est membre de la ComUE Lille Nord de France.More info here."}, {"link": "https://www.mooc-list.com/university-entity/catalyst", "name": "Catalyst", "description": "Catalyst is the leading nonprofit organization with a mission to expand opportunities for women and business. They are dedicated to creating more inclusive workplaces where employees representing every dimension of diversity can thrive.Through their pioneering research, their tools and services, their events, and their Awards, Catalyst's offerings raise awareness of how diversity benefits today’s global businesses, and provide guidance on how to enact real change.Catalyst invites women, men, and organizations to join with them in building the inclusion that will make business, society, and lives change for the better.More info here."}, {"link": "https://www.mooc-list.com/university-entity/waseda-university", "name": "Waseda University", "description": "Waseda University is a leading institution in Japan, founded in 1882 with three principles: academic independence, practical innovation, and the shaping of open-minded citizens; aiming to provide the world with progressive leaders.Waseda has stayed true to these ideals, educating seven prime ministers and countless other politicians, business leaders, journalists, diplomats, scholars, scientists, inventors, actors, writers and artists.Waseda's history and tradition is to tirelessly challenge convention, in favor of progression and innovation. By its 150th anniversary in 2032, the University has committed to expanding its leadership in Asia and around the world.More info here."}, {"link": "https://www.mooc-list.com/university-entity/raspberry-pi-foundation", "name": "Raspberry Pi Foundation", "description": "The Raspberry Pi Foundation works to put the power of digital making into the hands of people all over the world, so they are capable of understanding and shaping our increasingly digital world, able to solve the problems that matter to them, and equipped for the jobs of the future.We provide low-cost, high-performance computers that people use to learn, solve problems and have fun. We provide outreach and education to help more people access computing and digital making. We develop free resources to help people learn about computing and how to make things with computers, and train educators who can guide other people to learn.More info here."}, {"link": "https://www.mooc-list.com/university-entity/grenoble-ecole-de-management", "name": "Grenoble Ecole de Management", "description": "Established in 1984 by Grenoble’s Chamber of Commerce and Industry, Grenoble Ecole de Management is one of the best French (top 6) and European (top 20) business schools.Each year, Grenoble Ecole de Management trains approximately 7,000 students and executives, delivering over 50 national and international programs, from undergraduate to doctoral level, on several campuses worldwide.Grenoble Ecole de Management is one of only a few business schools worldwide to hold the triple EQUIS, AACSB and AMBA accreditation crown. It is also a member of the Conférence des Grandes Ecoles, and regularly ranked in French and international rankings.Based in Grenoble, the French capital of the Alps and of innovation, Grenoble Ecole de Management has developed a unique expertise in the management of technology, innovation and entrepreneurship.With this specialism, the School is a founding member of the global innovation campus, GIANT (Grenoble Innovation for Advanced New Technologies), which represents a 1.3 billion euros investment over five years."}, {"link": "https://www.mooc-list.com/university-entity/linux-foundation", "name": "Linux Foundation", "description": "More than 20 years ago, Linus Torvalds sparked an open source revolution with a short email declaring he was doing a new project “just for fun.” Today, Linux powers 98% of the world’s super computers, most of the servers powering the Internet, the majority of financial trades worldwide and tens of millions of Android mobile phones and consumer devices. In short, Linux is everywhere.The Linux Foundation is here to help. By supporting the kernel development community -- including employing Linus Torvalds himself -- and fostering collaboration on a truly massive scale, the Linux Foundation unites thousands of curious minds in the free and open exchange of ideas. With this collective wisdom, people everywhere are using Linux to solve harder problems, innovate faster than ever, and change the way the world works together. We are here to provide the crucial services and collaborative infrastructure to continue Linux’ advancement and protection.The Linux Foundation is also here to help companies and individuals navigate the ever-changing landscape of Linux. From new member mentoring programs to advanced consulting services, we’re here to guide you through the labyrinth of open source opportunities—so you can make the most of your Linux investment. Join us.We are also dedicated to expanding the collaborative DNA of Linux to other industries and markets. Companies, open source projects and individual developers can work with our Linux Foundation Collaborative Projects to make collaborative development the de facto way of solving the world’s hardest problems. Just like the Linux platform itself, our Linux Foundation community is intrinsically designed for flexibility. Whether you want to boost your open source compliance know-how, meet with developers from around the world, help staff build their Linux chops, or participate in massive collaborative efforts, your opportunities to get involved are literally wide open. More info here."}, {"link": "https://www.mooc-list.com/university-entity/seattle-central-community-college", "name": "Seattle Central Community College", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/columbiax", "name": "ColumbiaX", "description": "Columbia University is one of the world's most important centers of research and at the same time a distinctive and distinguished learning environment for undergraduates and graduate students in many scholarly and professional fields. The University recognizes the importance of its location in New York City and seeks to link its research and teaching to the vast resources of a great metropolis.For more than 250 years, Columbia has been a leader in higher education in the nation and around the world. At the core of our wide range of academic inquiry is the commitment to attract and engage the best minds in pursuit of greater human understanding, pioneering new discoveries and service to society.More info: http://www.columbia.edu/"}, {"link": "https://www.mooc-list.com/university-entity/universitas-telef%C3%B3nica", "name": "Universitas Telefónica", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-bergen", "name": "University of Bergen", "description": "The University of Bergen is a young, modern university. Most of its premises are concentrated in the heart of the city of Bergen.The University of Bergen is Norway's urban university who is intricately woven into the geographical, historical and cultural framework of the city, with 14,450 students and 3,460 faculty and staff.More info: http://www.uib.no/en/node/36362"}, {"link": "https://www.mooc-list.com/university-entity/university-minnesota", "name": "University of Minnesota", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/metropolitan-community-college", "name": "Metropolitan Community College", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/open-education-consortium-oec", "name": "Open Education Consortium (OEC)", "description": "The Open Education Consortium is a worldwide community of hundreds of higher education institutions and associated organizations committed to advancing open education and its impact on global education.More info here."}, {"link": "https://www.mooc-list.com/university-entity/pontificia-universidad-cat%C3%B3lica-de-chile", "name": "Pontificia Universidad Católica de Chile", "description": "More info: http://www.uc.cl/"}, {"link": "https://www.mooc-list.com/university-entity/televisi%C3%B3n-educativa", "name": "Televisión Educativa", "description": "The Ministry of Education of México (SEP) through Television Educativa signed a cooperation agreement as a member with edX. The Mexican Government made a covenant with its most prestigious educational institutions to offer the best massive online open courses.Televisión Educativa is part of the Secretaría de Educación Pública (Ministry of Education) of México. It was created with the aim of contributing to the strengthening and development of teaching, and offers new alternatives for audiovisual education aimed at resolving the educational gap, especially in rural areas, through the EDUSAT Network. Its mission is to produce and broadcast audiovisual educational, cultural and informational content in its various forms through information and communication technologies (ICTs) to contribute to all Mexicans access to quality education.Televisión Educativa aims to be a world reference in the production, distribution and broadcast of audiovisual educational, cultural and informational content, providing access to distance education, helping to enhance the quality of life of México's population. Throughout nearly 50 years of activities, Televisión Educativa has transformed and adapted to support education in México, for which it has a strong infrastructure; it´s a pioneer in Distance Education mode and it has positioned as one of the most important of its kind in Latin America.In December 2013, to mark Television Educativa commitment to innovation in teaching and learning, and in accordance to the National Digital Strategy, a priority from the Federal Government of President Enrique Peña Nieto, signed a cooperation agreement with edX.org, to facilitate the online education initiatives, offering and developing online interactive classes and MOOCs from the world’s best universities."}, {"link": "https://www.mooc-list.com/university-entity/eduonix-learning-solutions-pvt-ltd", "name": "Eduonix Learning Solutions Pvt. Ltd.", "description": "Eduonix learning Solutions is the premier training and skill development organization which was started with a vision to bring world class training content, pedagogy and best learning practices to everyone's doorsteps . Eduonix aims to identify and provide the best learning and training environment. It identifies industry veterans and content creators around the globe and bring it to the global audience using number of intuitive platforms for easy and affordable access to quality content. Eduonix offers easy to understand online courses and workshops for everyday people. If you have ever wanted to learn a new skill, but don't want to attend four years of college to do it, we have a solution for you.More info here."}, {"link": "https://www.mooc-list.com/university-entity/universidad-del-salvador-usal", "name": "Universidad del Salvador (USAL)", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-pittsburgh", "name": "University of Pittsburgh", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/st-george%E2%80%99s-university", "name": "St. George’s University", "description": "Founded as an independent School of Medicine in 1976, St. George’s University has evolved into a top center of international education, drawing students and faculty from 140 countries to the island of Grenada, in the West Indies. Students attending St. George’s enjoy the benefits of a thriving multicultural environment on the True Blue campus, offering all the amenities and technologically-advanced facilities of a world-class institution.The University’s over 12,000 graduates include physicians, veterinarians, scientists, and public health and business professionals across the world. The University offers advanced, premedical, and preveterinary degrees in its Schools of Medicine and Veterinary Medicine, and independent and dual graduate degrees in the sciences, public health, and business. Undergraduate degree programs are also available through its School of Arts and Sciences. The University programs are accredited and approved by many governing authorities. St. George’s is affiliated with educational institutions worldwide, including the United States, the United Kingdom, Canada, Australia and Ireland.More info: http://www.sgu.edu"}, {"link": "https://www.mooc-list.com/university-entity/universidad-tecnol%C3%B3gica-nacional", "name": "Universidad Tecnológica Nacional", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/mohadoha", "name": "Mohadoha", "description": "More info: http://www.mohanalakshmi.com/"}, {"link": "https://www.mooc-list.com/university-entity/otis-college-art-and-design", "name": "Otis College of Art and Design", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/wasedax", "name": "WasedaX", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/friday-institute-educational-innovation", "name": "The Friday Institute for Educational Innovation", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/cybrary", "name": "Cybrary", "description": "Cybrary.IT is a revolution for the global citizens who believe IT and Cyber Security should be liberated. We provide a free and open source Information Technology (IT) and Cyber Security training environment. We believe in keeping the world’s IT professionals prepared for the ever changing industry and its evolving technologies, as well as providing an excellent source of learning for the people who cannot afford the traditional options. You can learn almost anything IT and cyber security related, for free.More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-copenhagen", "name": "University of Copenhagen", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/ku-leuven-university", "name": "KU Leuven University", "description": "Situated in Belgium, in the heart of Western Europe, KU Leuven has been a centre of learning for nearly six centuries. Today, it is Belgium's largest university and, founded in 1425, one of the oldest and most renowned universities in Europe. As a leading European research university and co-founder of the League of European Research Universities (LERU), KU Leuven offers a wide variety of international master’s programmes, all supported by high-quality, innovative, interdisciplinary research. Since its founding, KU Leuven has been based in the city that shares its name. Leuven is a pleasant, safe and bustling student town, where centuries-rich history meets cutting-edge science. The university also offers degree programmes at campuses in 11 Belgian cities, including Brussels, Ghent and Antwerp.More info here."}, {"link": "https://www.mooc-list.com/university-entity/cpge-economiques-et-commerciales", "name": "CPGE économiques et commerciales", "description": "L'APHEC, ESCP Europe et SKEMA s’associent pour produire un MOOC d’orientation afin d’informer sur les classes préparatoires économiques et commerciales (anciennement \" Prépa HEC \") et les grandes écoles de commerce. Ce MOOC s'inscrit dans le cadre de la coopération entre l'APHEC et la CGE (au sein de laquelle la Directrice générale de SKEMA préside le Chapitre des Écoles de management et le Directeur général de ESCP Europe préside la Commission Formation).APHECL’APHEC est l’Association des Professeurs des classes préparatoires Économiques et Commerciales. Elle réunit quelque 1400 professeurs adhérents répartis dans environ 170 établissements publics et privés sous contrat. L’APHEC entretient un dialogue privilégié avec les grandes écoles de management et l’ensemble des acteurs institutionnels sur toutes les thématiques qui concernent la filière économique et commerciale des classes préparatoires au Master en management. L’APHEC est membre de la Conférence des Grandes Écoles et du Comité de Concertation et de Suivi des classes préparatoires au ministère de l’enseignement supérieur.ESCP EUROPEESCP Europe est la première école de commerce au monde (fondée en 1819 à Paris) et la seule pan-européenne. Elle délivre un portefeuille complet de programmes : du Bac+3 au Bac+8 (BSc, MiM, MS/MSc, MBA, PhD) et en Formation Continue. ESCP Europe c'est aussi :· + de 5000 étudiants répartis sur 6 campus urbains: Berlin, Londres, Madrid, Paris, Turin et Varsovie· 140 professeurs-chercheurs représentant plus de 20 nationalités, sur nos 6 campus.· 130 partenariats académiques en Europe et dans le monde· une Triple Accréditation AACSB-EQUIS-AMBA une reconnaissance nationale comme établissement d'enseignement supérieur dans nos 5 pays fondateursSKEMA :SKEMA Business School est un établissement d’enseignement supérieur et de recherche privé sous statut d’association Loi 1901 sans but lucratif. SKEMA est née en 2009 de la fusion entre l'Ecole Supérieure de Commerce de Lille et le CERAM Business School de Sophia Antipolis. Ces deux écoles fondatrices ont respectivement été fondées en 1892 pour l’une et 1963 pour l’autre.SKEMA est une communauté dédiée à l’apprentissage, à la création et à la transmission des connaissances et des pratiques de management. Depuis sa création, SKEMA a relevé le défi d’être une école globale grâce à sa structure multi-campus et offre un large portefeuille de programmes francophones et anglophones en formation initiale et en formation continue, aux niveaux Licence, Master et Doctorat.→ Plus de 8 000 étudiants (40% d’étudiants internationaux)→ 40 000 alumni dans 134 pays dans le monde→ 160 professeurs permanents→ Plus de 100 partenariats avec des universités internationales (76% accréditées)→ 6 campus : 3 sites en France, 1 campus à Suzhou (China), 1 campus à Raleigh (USA), 1 campus à Belo Horizonte (Brazil)→ Plus de 65 associations étudiantes."}, {"link": "https://www.mooc-list.com/university-entity/eindhoven-university-technology", "name": "Eindhoven University of Technology", "description": "Studying at TU/e means studying at a Dutch top university. A university with a unique Bachelor College and its own Graduate School .High rankingThat’s evident from the high position of our university in national and international rankings:- In the Times Higher Educational World University Rankings of 2013-2014 Eindhoven University of Technology was ranked 106, best of all Dutch universities.- Our position at QS World University Rankings in 2013 is 157.- Our university is considered the best Dutch engineering and science university by the Study Guide to Universities 2013.- Eindhoven University of Technology (TU/e) has been named as best university in the Netherlands by the weekly magazine Elsevier.More info: http://www.tue.nl/en/"}, {"link": "https://www.mooc-list.com/university-entity/university-south-florida", "name": "University of South Florida", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/fx-academy", "name": "FX Academy", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-london", "name": "University of London", "description": "More info: http://www.londoninternational.ac.uk/"}, {"link": "https://www.mooc-list.com/university-entity/universidad-nacional-aut%C3%B3noma-de-m%C3%A9xico", "name": "Universidad Nacional Autónoma de México", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/rochester-institute-technology", "name": "Rochester Institute of Technology", "description": "Rochester Institute of Technology is home to leading creators, entrepreneurs, innovators and researchers. Founded in 1829, RIT enrolls more than 18,600 students in more than 200 career-oriented and professional programs, making it among the largest private universities in the U.S.RIT’s nine colleges emphasize career education and experiential learning with programs that are internationally recognized and ranked for academic leadership in business, computing, engineering, imaging science, liberal arts, sustainability, and fine and applied arts. RIT also offers unparalleled support services for more than 1,200 deaf and hard-of-hearing students. The cooperative education program is one of the oldest and largest in the nation. The university’s main campus occupies 1,300 acres in suburban Rochester, N.Y. and its global partnerships include campuses in Croatia, Dubai and Kosovo.More info here."}, {"link": "https://www.mooc-list.com/university-entity/george-washington-university", "name": "George Washington University", "description": "Our University actively engages Washington, D.C., and the world. Our location in the heart of Washington places us at the core of U.S. government, policy and law. We sit where the worlds of science, technology, media and the arts converge. Our students and faculty have the unparalleled opportunity to study and work alongside leaders and practitioners in every discipline, to take part in the interchanges that shape our community and the world.More info: http://www.gwu.edu/"}, {"link": "https://www.mooc-list.com/university-entity/julius-maximilians-universit%C3%A4t-w%C3%BCrzburg", "name": "Julius-Maximilians-Universität Würzburg", "description": "More info: http://www.uni-wuerzburg.de/en/home/"}, {"link": "https://www.mooc-list.com/university-entity/iit-bombay", "name": "IIT Bombay", "description": "IIT Bombay, the second in the chain of IITs, was set up in 1958. It was the first IIT to be set up with foreign assistance. The funds came from UNESCO in roubles from the Soviet Union. In 1961, the Parliament decreed IITs as 'Institutes of National Importance'. Since then, IIT Bombay has grown from strength to strength to emerge as one of the top technical universities in the world.IIT Bombay has a total of 14 academic departments, six centres, one school, and three interdisciplinary programmes. It is recognised worldwide as a leader in the field of engineering education and research. It is reputed for the quality of its faculty and the outstanding calibre of students graduating from its undergraduate and postgraduate programmes.Over the last fifty-three years, around 39,000 engineers and scientists have graduated from the institute. It is noted for its strong research groups in varied areas of science and technology that are making substantial contributions to national projects. Educational progammes here extend beyond the physical sciences and engineering into humanities and social sciences such as Economics, English, Philosophy, Psychology and Sociology and into management studies. Over the years, the institute has also created a niche for its innovative short-term courses through continuing education and distance education programmes. In 2011, a total of 1846 degrees, including 173 Ph.D., were awarded, which represents 9.2 per cent increase in the total number of degrees awarded in the previous year. The faculty of the institute has won many prestigious awards and recognitions, including nine Shanti Swaroop Bhatnagar awards.Residents at IIT Bombay have the twin advantage of being located at the financial capital of India while enjoying the serene environs of the campus located at Powai, situated in the northern suburbs of Mumbai, in Western India. It is a fully residential institute, with all its students staying on campus. The students are accommodated in 14 hostels with in-house dining and excellent amenities for sports and other recreational facilities.More info here."}, {"link": "https://www.mooc-list.com/university-entity/vanderbilt-university", "name": "Vanderbilt University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-illinois-urbana-champaign", "name": "University of Illinois at Urbana-Champaign", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/torrens-university-australia", "name": "Torrens University Australia", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/simpliv-llc", "name": "Simpliv LLC", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-florida", "name": "University of Florida", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/national-arts-strategies-nas", "name": "National Arts Strategies (NAS)", "description": "NAS has been working with leaders in arts and culture for over thirty years. We've seen that a dynamic, sustainable arts community comes from the vision and effort of skilled professionals. In our organizational leadership programs arts leaders explore the toughest challenges facing organizations today, and learn from some of the leading business school faculty in the United States. The experience is always interactive and engaging, respectful but demanding. And it brings the best thinking from outside the arts sector into the community, challenging arts and cultural leaders to take a fresh look at their organizations.More info: http://www.artstrategies.org/about/index.php"}, {"link": "https://www.mooc-list.com/university-entity/radboud-university-nijmegen", "name": "Radboud University Nijmegen", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/z-smith-reynolds-library-wake-forest-university", "name": "Z. Smith Reynolds Library at Wake Forest University", "description": "The mission of the Z. Smith Reynolds Library (ZSR) at Wake Forest University is to help our students, faculty, and staff succeed. We do this by providing unparalleled service in managing, delivering and teaching the use of scholarly content and information technology."}, {"link": "https://www.mooc-list.com/university-entity/curtinx", "name": "CurtinX", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/responseable", "name": "ResponSEAble", "description": "How can we encourage Europeans to take a closer interest in their oceans and to treat them with greater respect and understanding? That’s the over-riding objective of ResponSEAble, an ambitious, 15-partner project. Our project is funded by Horizon 2020, ResponSEAble is mapping European marine research and knowledge to further our understanding of complex human-ocean relationships and the economic benefits that we derive from our seas and the ecosystems they support.The project is also working on a raft of exciting media and outreach activities including films and film making competitions, an educational computer game and other learning materials, a social media campaign and an interactive website. The project’s media outreach aims to connect with a wide range of audiences. By generating greater public debate and knowledge, ResponSEAble, intends to support all sectors of European society take a more informed and responsible attitude and help secure healthier and more sustainable oceans.More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-north-texas", "name": "University of North Texas", "description": "As one of Texas' largest universities, we offer 98 bachelor's, 82 master's and 36 doctoral degree programs.By providing access, welcoming diversity and strengthening our collaborations with our many educational, business and community partners, as well as building new partnerships across the globe, UNT's faculty and staff work each day to prepare students for the challenges they will meet in our changing world.More info here."}, {"link": "https://www.mooc-list.com/university-entity/deakin-university", "name": "Deakin University", "description": "Deakin University offers a brilliant education where students are and where they want to go – in their lives and in their careers. Deakin is Australia’s eighth largest university with over 53 000 students from more than 100 countries, with one quarter choosing to study wholly online at our Cloud Campus.Deakin excels in research, ranking in the top two per cent of universities in the world in fields including nutrition, information technology and carbon fibre.^ Deakin is also a leader in the quality of teaching and learning, ranking first for student satisfaction in the state of Victoria, Australia for six consecutive years (Australian Graduate Survey, 2010-2015). Deakin University offers you a personalised experience with premium digital engagement, creating the power and opportunities to live in a connected and evolving world.Deakin is Australia’s premier university in driving the digital frontier – to enable globally connected education for the jobs of the future, and research that makes a difference to the communities we serve.More info here."}, {"link": "https://www.mooc-list.com/university-entity/world-education-university", "name": "World Education University", "description": "WEU (pronounced we-you) is dedicated to one goal – to provide 100% FREE high quality college level education to anyone, anywhere, anytime. There is no tuition, no fees and no costs for textbooks. All we ask in return is that you honor “The WEU Pay-it-Forward Pledge™” and find a way to take your free education and pay it forward.The most important part of WEU is you, the student. Our uniquely interactive, self-paced and completely online platform is one of the most learning-friendly available anywhere. Our platform is designed around you the student and the way you learn. Enrollment includes a Cognitive Learning Assessment (CLA) to help you understand your specific learning preferences, which can lead to improved academic performance, smarter career choices and greater personal satisfaction."}, {"link": "https://www.mooc-list.com/university-entity/dartmouth", "name": "Dartmouth", "description": "Founded in 1769, Dartmouth is a member of the Ivy League and consistently ranks among the world's greatest academic institutions. Dartmouth has forged a singular identity for combining its deep commitment to outstanding undergraduate liberal arts and graduate education with distinguished research and scholarship in the Arts & Sciences and its three leading professional schools—the Geisel School of Medicine, Thayer School of Engineering, and the Tuck School of Business.More info here."}, {"link": "https://www.mooc-list.com/university-entity/american-museum-natural-history", "name": "American Museum of Natural History", "description": "The American Museum of Natural History is one of the world’s preeminent scientific, educational and cultural institutions. Since its founding in 1869, the Museum has advanced its global mission to discover, interpret, and disseminate information about human cultures, the natural world, and the universe through a wide-ranging program of scientific research, education, and exhibition.More info: http://www.amnh.org"}, {"link": "https://www.mooc-list.com/university-entity/universit%C3%A9-libre-de-bruxelles", "name": "Université libre de Bruxelles", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/michiganx", "name": "MichiganX", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/national-stem-learning-centre", "name": "National STEM Learning Centre", "description": "The National STEM Learning Centre provides world-class professional development activities and resources to support the teaching of STEM (science, technology, engineering and mathematics) subjects. The Centre is a purpose-built, state of the art facility based at the University of York backed by an unrivalled team of experts in the fields of education and STEM.Our team has created a suite of online and bursary supported face-to-face professional development for teachers and support staff throughout their careers. Extensive research shows the direct positive impact of our professional development on participants, students, schools and colleges.We host a free library of online resources holding thousands of quality assured and curated STEM teaching resources alongside those contributed by the wider teaching community.The National STEM Learning Centre is operated by STEM Learning Ltd. STEM Learning (formerly Myscience) is an initiative of the White Rose University Consortium (comprising the Universities of Leeds, Sheffield and York) and Sheffield Hallam University. STEM Learning manages the National Science Learning Network, the National STEM Centre and other programmes supporting STEM education."}, {"link": "https://www.mooc-list.com/university-entity/university-edinburgh", "name": "University of Edinburgh", "description": "More info: http://www.ed.ac.uk/home"}, {"link": "https://www.mooc-list.com/university-entity/google-education", "name": "Google for Education", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-colorado-boulder", "name": "University of Colorado Boulder", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-colorado-system", "name": "University of Colorado System", "description": "The University of Colorado is a public research university with multiple campuses serving Colorado, the nation and the world through leadership in high-quality education and professional training, public service, advancing research and knowledge, and state-of-the-art health care. Each campus has a distinct role and mission as provided by Colorado law.More info here."}, {"link": "https://www.mooc-list.com/university-entity/marginal-revolution-university", "name": "Marginal Revolution University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/%C3%A9cole-polytechnique", "name": "École Polytechnique", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/le-cnam", "name": "le cnam", "description": "Conservatoire national des arts et métiers."}, {"link": "https://www.mooc-list.com/university-entity/university-manchester", "name": "University of Manchester", "description": "Tracing its roots back to 1824, the University of Manchester is home to almost 40,000 students. The University has three Nobel laureates among its current staff – more than any other British university - and a total of 25 Nobel laureates have come from our past and present students and staff. We have three main goals: to undertake world-class research; to deliver an outstanding learning and student experience; and to be socially responsible.More info: http://www.manchester.ac.uk/"}, {"link": "https://www.mooc-list.com/university-entity/university-technology-malaysia", "name": "University of Technology, Malaysia", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-hull", "name": "University of Hull", "description": "More info: http://www2.hull.ac.uk/"}, {"link": "https://www.mooc-list.com/university-entity/trinity-laban-conservatoire-music-and-dance", "name": "Trinity Laban Conservatoire of Music and Dance", "description": "Trinity Laban is the UK’s only conservatoire of music and contemporary dance.Leaders in music and contemporary dance education, we also provide exciting opportunities for the public to encounter dance and music, and access arts health programmes. The unequalled expertise and experience of our staff are brought together through our online distance learning offer, as well as through our world class facilities at our faculty campuses in Greenwich and Deptford.Our innovative course provision, exciting performances and groundbreaking education, community and social inclusion work make Trinity Laban a leader in the advancement of creative artistic practice. Our unique conjunction has created exciting and uniquely accessible opportunities for collaboration between instrumentalists, singers, composers, dancers and choreographers."}, {"link": "https://www.mooc-list.com/university-entity/universidad-abat-oliba-ceu", "name": "Universidad Abat Oliba CEU", "description": "The Abat Oliba CEU University (UAO CEU) is one of the three universities promoted by the San Pablo CEU Foundation. Since it became a private university in 2003, the UAO CEU has bet on a distinguishing academic model based on the permanent connection between teachers and students and the establishment of innovative educational methodologies. The Abat Oliba CEU University is also concerned about giving the students a complete training so that they can face their personal and professional challenges with their own and solid judgments.More info: http://www.uaoceu.es"}, {"link": "https://www.mooc-list.com/university-entity/smarton-learning-solutions", "name": "SmartOn Learning Solutions", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/delftx", "name": "DelftX", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/arts-et-m%C3%A9tiers-paristech", "name": "Ecole Nationale Supérieure d’Arts et Métiers", "description": "L’Ecole Nationale Supérieure d’Arts et Métiers (ENSAM), dénommée Arts et Métiers ParisTech, est une Grande Ecole d’Ingénieurs publique. Elle a formé plus de 85000 ingénieurs depuis sa création en 1780 par le Duc de La Rochefoucauld Liancourt.Arts et Métiers ParisTech est un grand établissement technologique proposant des formations initiales du Bac au Bac +8 et a pour mission principale la formation d’ingénieurs aux disciplines du génie mécanique, du génie énergétique et du génie industriel : conception-réalisation, procédés-industrialisation, tenue en service-usages.Etablissement unique coordonné par une Direction Générale, Arts et Métiers ParisTech comprend 8 Campus et 3 instituts répartis sur l’ensemble du territoire français. Ces sites lui confèrent une proximité exceptionnelle avec le milieu industriel en régions.La stratégie d’Arts et Métiers ParisTech en matière de numérique est d’intégrer les TICE comme service d’appui à la formation et comme moyen pour faire évoluer les pratiques pédagogiques et favoriser ainsi la réussite des élèves.L’engagement d’Arts et Métiers dans la création de MOOC vient des initiatives de ses équipes pédagogiques souhaitant innover en intégrant pleinement le numérique dans leur manière d’enseigner. Elles souhaitent à travers les MOOC rendre leurs enseignements accessibles à un large public, et favoriser le développement de communautés rassemblant le monde de l’enseignement, de la recherche, de l’industrie et un public curieux de découvrir des nouvelles pratiques d’enseignement.More info here."}, {"link": "https://www.mooc-list.com/university-entity/chalmersx", "name": "ChalmersX", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/santa-fe-institute", "name": "Santa Fe Institute", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/institut-sup%C3%A9rieur-de-la%C3%A9ronautique-et-de-lespace-isae-supaero", "name": "Institut Supérieur de l'Aéronautique et de l'Espace (ISAE) SUPAERO", "description": "Institut Supérieur de l'Aéronautique et de l'Espace.More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-rochester", "name": "University of Rochester", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/higher-school-economics-hse-national-research-university", "name": "Higher School of Economics (HSE) - National Research University", "description": "National Research University - Higher School of Economics (HSE) is one of the top research universities in Russia. Established in 1992 to promote new research and teaching in economics and related disciplines, it now offers programs at all levels of university education across an extraordinary range of fields of study including business, sociology, cultural studies, philosophy, political science, international relations, law, Asian studies, media and communications, IT, mathematics, engineering, and more.More info here."}, {"link": "https://www.mooc-list.com/university-entity/hasso-plattner-institut", "name": "Hasso-Plattner-Institut", "description": "More info: http://www.hpi.uni-potsdam.de/willkommen.html?L=1"}, {"link": "https://www.mooc-list.com/university-entity/brown-university", "name": "Brown University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/rwthx", "name": "RWTHx", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/acumen", "name": "Acumen", "description": "We created +Acumen to give people a meaningful way to ‘Add Acumen’ to their lives, and our online courses are a new way to do just that. With 7+ years of experience running our flagship Acumen Global Fellows Program, we saw an opportunity to use online tools to scale the impact of our traditional leadership development programs to equip more emerging leaders with the tools, knowledge, and networks to change the way the world tackles poverty. At Acumen, leadership begins with moral imagination: the humility to see the world as it is, and the audacity to imagine the world as it could be. Combined with operational skills and financial skills, our courses aim to equip emerging change leaders with the tools to change the way the world tackles poverty and build a world based on dignity."}, {"link": "https://www.mooc-list.com/university-entity/utaustinx", "name": "UTAustinX", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-california-santa-cruz", "name": "University of California, Santa Cruz", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-strathclyde", "name": "University of Strathclyde", "description": "The University of Strathclyde is a leading international technological university.It is recognised for strong research links with business and industry, commitment to enterprise and skills development and knowledge sharing with the private and public sectors. Situated in the heart of Glasgow – one of the UK’s largest cities – the University has a vibrant, international academic community and is home to more than 22,000 students from more than 100 nations.Strathclyde is delivering research solutions to the many global challenges facing society today in areas like sustainable energy, health technologies, business innovation and the improvement of education.The University was named UK University of the Year in the 2012 Times Higher Education Awards.More info here."}, {"link": "https://www.mooc-list.com/university-entity/openclassrooms", "name": "OpenClassrooms", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-college-cork", "name": "University College Cork", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/colorado-state-university", "name": "Colorado State University", "description": "Colorado State University, a land-grant institution and a Carnegie Doctoral/Research University-Extensive, is one of the United States’ leading research universities, with world-class research and academic programs in infectious disease, atmospheric science, clean energy technologies, human and animal health, environmental science, global business and more.Founded in 1870 in Fort Collins, Colorado State has more than 33,000 students, and annual research funding of more than $300 million. Colorado State University is the university of choice for Colorado residents – more Colorado high school graduates choose CSU than any other campus. With its strong STEM disciplines, 30 percent of all of Colorado’s science, math, engineering, and technology majors pursue degrees at CSU.From the base of the Rocky Mountains, Colorado State advances a distinctive model of a modern public research university, where striking natural surroundings and the heritage of the American West come together with academic, intellectual, and personal discovery. Colorado State students, dedicated to service in the community and beyond, regularly work hand-in- hand with University research faculty and together they pursue the possibility of transformative action and achieving excellence in all they do.For almost 50 years, Colorado State has been delivering online and distance programs through CSU Online, which is the University’s Division of Continuing Education. CSU Online partners with the University’s teaching and research faculty to create and deliver exceptional programs that meet the needs of those who cannot or choose not to come to campus. CSU Online provides affordable access to a quality education from wherever students call home around the nation and world, on a schedule that fits their lives.More info here."}, {"link": "https://www.mooc-list.com/university-entity/wageningenx", "name": "WageningenX", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/open-university", "name": "The Open University", "description": "The Open University (OU) is the largest academic institution in the UK and a world leader in flexible distance learning.Since it began in 1969, the OU has taught more than 1.8 million students and has almost 250,000 current students, including more than 15,000 overseas. The OU is rated in the top five of UK universities for student satisfaction in the National Student Survey, since the survey began in 2005. In 2012/13 it had a 92% satisfaction rating. Over 70% of students are in full-time or part-time employment, and four out of five FTSE 100 companies have sponsored staff to take OU courses.In the UK’s latest Research Assessment Exercise (RAE 2008) the Open University was ranked in the top third of UK higher education institutions. More than 50% of OU research was assessed in the RAE as internationally excellent, with 14% as world leading.Regarded as Britain’s major e-learning institution, the OU is a world leader in developing technology to increase access to education on a global scale. Its vast ‘open content portfolio’ includes free study units on OpenLearn, which has had more than 26.7 million visits, and materials on iTunes U, which has recorded more than 60 million downloads. The OU has a 41 year partnership with the BBC which has moved from late-night lectures in the 1970s to prime-time programmes such as Frozen Planet, Bang Goes the Theory, James May’s Big Ideas and The Money Programme.More info: http://www.open.ac.uk/"}, {"link": "https://www.mooc-list.com/university-entity/griffith-university", "name": "Griffith University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/massey-university", "name": "Massey University", "description": "Massey University is characterised by the applied nature of many of its teaching and research programmes and by its expertise in the areas of technology, science, applied science and business studies. Its proficiency embraces a broad span of scholarly and scientific realms. Aviation and epidemiology, jazz and quantum physics, ecology and agri-food, finance and robotics, biotechnology and vulcanology; these are just some of the disciplines in which Massey is acknowledged as world-class. Massey has a proud international record of using this expertise to work with developing countries, and its focus on technology and business is also meeting new international demands. Massey graduates hold positions of seniority and responsibility throughout the world.Massey prides itself on being a research-focused university. The university has some of the world’s pre-eminent researchers, across all areas of expertise. This translates to contemporary, relevant and easily applied teaching, preparing students for not just great careers, but to lead the world.Though very much a New Zealand university and one which sees itself as defining what New Zealand is about, Massey has always prided itself on its international outlook and reputation. The university prepares students with programmes that are relevant, innovative and flexible. Massey University has an excellent record of engagement with communities, and are proud to support educational opportunity in New Zealand and around the world. As New Zealand’s defining tertiary education institution, Massey University provided the underpinning knowledge for New Zealand’s successful development in much of the 20th century. In the 21st century the university aspires to serve and lead as the ‘engine’ of this new New Zealand.More info: http://www.massey.ac.nz/massey/home.cfm"}, {"link": "https://www.mooc-list.com/university-entity/technion-israel-institute-technology", "name": "Technion - Israel Institute of Technology", "description": "More info: http://www.technion.ac.il/"}, {"link": "https://www.mooc-list.com/university-entity/universit%C3%A4t-des-saarlandes", "name": "Universität des Saarlandes", "description": "Saarland University is a modern university within the Saar-Lor-Lux region – a dynamic part of Europe defined by the shared borders between Germany, France and Luxembourg. An international perspective has been a defining feature of Saarland University ever since it was established in cooperation with France in 1948. Today, 18.500 young people are studying in Saarbrücken and Homburg (faculty of medicine), 16 per cent of whom are international students. Located in a pleasant woodland setting, the university campus offers students and researchers a broad range of sporting and cultural activities, which together with the numerous cafés and restaurants make the campus an ideal place to relax between lectures or after work. And thanks to the high-speed ICE train link it takes only two hours to travel from Saarbrücken to Paris.More info: http://www.uni-saarland.de/"}, {"link": "https://www.mooc-list.com/university-entity/fachhochschule-l%C3%BCbeck", "name": "Fachhochschule Lübeck", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/lancaster-university", "name": "Lancaster University", "description": "Ranked in the global top 1%, Lancaster is a collegiate university with a world-class reputation for research and teaching excellence.Lancaster pioneers globally significant research and uses its expertise to shape policy and encourage debate. Located on a beautiful campus in the North West of England and one of a handful of collegiate universities, Lancaster places great emphasis on a strong student experience and research-led teaching delivered by academics who are experts in their field. Ranked 9th in the THE’s global ‘100 under 50’ university league table, the University has established a global reputation as a centre for research, scholarship and teaching with an emphasis on employability.Following the latest research assessment exercise over 90% of the research at Lancaster was found to be world leading or internationally significant with some key areas of research ranked top in the UK.More info: http://www.lancaster.ac.uk/"}, {"link": "https://www.mooc-list.com/university-entity/philanthropy-university", "name": "Philanthropy University", "description": " Grow your skills. Grow your impact. Take Free Online Courses and Earn a Free Certificate of Completion in Social Impact Leadership from the Haas School of Business at the University of California, Berkeley!"}, {"link": "https://www.mooc-list.com/university-entity/fab-lab-polytech", "name": "Fab Lab Polytech", "description": "More info: http://fablab.spbstu.ru/"}, {"link": "https://www.mooc-list.com/university-entity/iai-academy", "name": "IAI Academy", "description": "More info: http://iai.tv/iai-academy/courses"}, {"link": "https://www.mooc-list.com/university-entity/universitat-pompeu-fabra", "name": "Universitat Pompeu Fabra", "description": "More info: http://www.upf.edu/"}, {"link": "https://www.mooc-list.com/university-entity/thunderbird-school-global-management", "name": "Thunderbird School of Global Management", "description": "For 70 years, Thunderbird has set the pace for global management education as the premier institution for students, organizations and professionals looking for an edge in international business. A consistently top-ranked international business school, Thunderbird understands the complexities, challenges and competitive forces that make business across borders a nuanced endeavor. A Thunderbird education sets you apart from the competition and prepares you to make an immediate, lasting impact worldwide.More info here."}, {"link": "https://www.mooc-list.com/university-entity/elements-pain", "name": "Elements of Pain", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-pennsylvania", "name": "University of Pennsylvania", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/hebrew-university-jerusalem", "name": "Hebrew University of Jerusalem", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/mcgillx", "name": "McGillX", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/universit%C3%A9-de-nantes", "name": "Université de Nantes", "description": "Université de Nantes has never stopped moving forward. In the last 50 years, Université de Nantes has taken training and research to the highest level. Facing a rapidly changing world, Université de Nantes invents a new model of university. This model places the student at its centre and, more than ever, the human being at the heart of its ambitions. Rooted in Nantes - a city renowned for its vitality, culture, economic development and its quality of life - Université de Nantes radiates also thanks to its 2 campuses in Saint- Nazaire and La-Roche-sur-Yon.With 34,000 students (including 3,750 foreign students) and 4,250 staff, 50% of which is dedicated to research, 1 out of 12 Nantes residents works or studies at Université de Nantes. True cultural, sports and society contributor, our universtity also encourages the revitalization of its region by enriching public debate and by stimulating creativity : conferences, up to date media equipment, artists-in-residence programs, high-level sports, student commitment through 150 student organisations.Within its campuses, different disciplines meet to enrich one another. Université de Nantes is one of the rare French universities to promote interdisciplinarity. Within 21 faculties and schools, 295 specialities are represented and 63 laboratories work in all fields of knowledge. 75% of them are A and A+ rated.More info here."}, {"link": "https://www.mooc-list.com/university-entity/keio-university", "name": "Keio University", "description": "Keio University is a private, comprehensive higher education institution located on six campuses spread across the Greater Tokyo area. It offers an environment of academic and research excellence in a wide range of fields, and includes a university hospital. Founded in 1858, it is Japan’s first modern institution of higher learning, and over the last century and a half it has established itself as a leader in Japan through its continued commitment to education, research and medicine.Keio has its origins in the school of Western learning established by Yukichi Fukuzawa, a school which soon evolved into a major center of learning. As a highly respected educator and intellectual, Fukuzawa was one of the pioneers of modern Japan. He aspired for Keio to become a model and leader of society, stressing the importance of learning that is based on jitsugaku, or “science”. In today’s changing world, Keio upholds its founder’s spirit of science as it continues to fulfill his aspiration."}, {"link": "https://www.mooc-list.com/university-entity/universit%C3%A9-de-bordeaux", "name": "Université de Bordeaux", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/openlearning", "name": "OpenLearning", "description": "More info: https://www.openlearning.com/"}, {"link": "https://www.mooc-list.com/university-entity/linuxfoundationx", "name": "LinuxFoundationX", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/international-telematic-university-uninettuno", "name": "International Telematic University UNINETTUNO", "description": "The International Telematic University UNINETTUNO is a single institution conceived on a grand scale. At UNINETTUNO, prestigious professors from the most important universities of the world teach courses in various languages in both real classrooms and virtual ones on the Internet.A dream that has become reality: you can attend your International University wherever you are. Distance, space and time are no longer an obstacle!More info: http://www.uninettunouniversity.net/en/default.aspx"}, {"link": "https://www.mooc-list.com/university-entity/peking-university-0", "name": "Peking University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/ecole-pratique-des-hautes-etudes", "name": "École Pratique des Hautes Études", "description": "L’École Pratique des Hautes Études (EPHE) est un grand établissement d’enseignement supérieur où l’on pratique la recherche dans trois sections : Sciences de la vie et de la terre, Sciences historiques et philologiques et Sciences religieuses. Son enseignement est dispensé à partir du niveau master. Elle accueille également des auditeurs libres.Établissement « hors-murs », l’EPHE est hébergée à la Sorbonne et dans différents centres de recherche à Paris, sur tout le territoire métropolitain et en Polynésie française.Au niveau international, l’EPHE entretient un réseau avec les organismes de recherche pour ses chercheurs et doctorants, ainsi que des partenariats pour ses étudiants avec plus de 100 grandes institutions (Italie, Suisse, Chine, Russie, Canada, Liban…). Près de la moitié des étudiants de l’EPHE sont étrangers et l’École invite de nombreux chercheurs étrangers chaque année.L’EPHE est membre de l’Université de recherche Paris Sciences et Lettres – PSLMore info here."}, {"link": "https://www.mooc-list.com/university-entity/helmut-schmidt-universit%C3%A4t-universit%C3%A4t-der-bundeswehr-hamburg", "name": "Helmut-Schmidt-Universität - Universität der Bundeswehr Hamburg", "description": "The Helmut Schmidt university is one of the two universities in Germany, that serve the scientific study and the academic education of armed forces' officers. It increases the attractiveness of the profession and is pulse generator and service provider for the Federal Armed Forces.The Helmut Schmidt University takes its tasks by research, theory and further training in the autonomy guaranteed by the responsible body and the Free and Hanseatic City of Hamburg.With its research infrastructure it strengthens the city of Hamburg as a center of knowledge.It develops the courses of study and further training offer according to the state of the sciences as well as for further needs of military, economics and society. It stresses and develops the possibilities of multidisciplinarity in research and teaching between social, natural, economical and engineering sciences, in order to sharpen the profile of the graduates in national and international competition and to improve their future prospects. That applies at least by promoting junior scientists.The Helmut Schmidt University is characterised by inner and outer openness and is guided by the aim to provide education by science for 21. century.More info: http://www.hsu-hh.de/hsu/index.php"}, {"link": "https://www.mooc-list.com/university-entity/asux", "name": "ASUx", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/trinity-college-hartford", "name": "Trinity College, Hartford", "description": " Founded in Hartford, Connecticut, in 1823, Trinity College is an independent, nonsectarian liberal arts college with more than 2,200 students from 44 states and 62 countries. It is home to the eighth-oldest chapter of Phi Beta Kappa in the United States. The faculty and alumni include recipients of the Pulitzer Prize, the MacArthur award, Guggenheims, Rockefellers, and other national academic awards. Trinity students integrate meaningful academic and leadership experience at all levels on the College’s celebrated campus, in the capital city of Hartford, and in communities all over the world.More info here."}, {"link": "https://www.mooc-list.com/university-entity/universit%C3%A9-jean-moulin-lyon-3", "name": "Université Jean Moulin Lyon 3", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/instituto-superior-t%C3%A9cnico-universidade-de-lisboa", "name": "Instituto Superior Técnico, Universidade de Lisboa", "description": "Com uma comunidade de mais de 12.000 pessoas, o Técnico é a maior Escola de Arquitetura, Engenharia, Ciência e Tecnologia em Portugal.More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-groningen", "name": "University of Groningen", "description": "The University of Groningen is a research university with a global outlook, deeply rooted in Groningen, in the north of the Netherlands.Quality has had top priority for 400 years, and with success the University is currently in or around the top 100 on several influential ranking lists.In addition, the university collaborates with a number of renowned foreign universities, including Uppsala, Göttingen and Ghent. The University of Groningen is very popular with its 27,000 students and 5500 staff members from home and abroad.Talent is nurtured, enabling the University to bridge the gap between science and society.We are committed to actively collaborating with our social partners, with a special focus on the research themes Healthy Ageing, Energy and Sustainable Society."}, {"link": "https://www.mooc-list.com/university-entity/united-cities-and-local-governments-africa", "name": "United Cities and Local Governments of Africa", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/coventry-university", "name": "Coventry University", "description": "Coventry University’s dynamic, global and transformational reputation can be traced back to 1843 to the Coventry School of Design. A provider of world-class teaching and learning with a focus on research with impact, Coventry pushes the boundaries of what higher education can achieve regionally, nationally and across the world.Through its links with leading-edge businesses and organisations in a variety of countries and industries, Coventry University’s 29,000+ students enjoy access to opportunities which ensure that their employment prospects and confidence are enhanced by the time they graduate.Coventry secured a gold rating in the UK government’s 2017 Teaching Excellence Framework (TEF) and is the country’s top modern university in the Guardian University Guide 2018, in which it ranks 12th overall. Coventry was also awarded the title ‘Modern University of the Year’ in the Times and Sunday Times Good University Guide for three years running from 2014 to 2016, was Times Higher Education (THE) University of the Year 2015 and placed in the top 200 in the THE’s Young University Rankings 2017.More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-naples-federico-ii", "name": "University of Naples Federico II", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/new-school", "name": "The New School", "description": "Forward-thinking educators founded The New School in 1919 to defy the intellectual constraints of traditional college education. As The New School approaches its centennial, it remains on the cutting edge—attracting active scholars, artists, and pacesetters who deploy creativity and innovation to challenge the status quo.In New York City, Paris, and online, The New School enrolls 10,000 degree-seeking students in more than 130 undergraduate and graduate programs focused on collaborative, project-based, interdisciplinary learning. Education is driven by open discussion in small classes and a human-centered approach to problem solving, combining design thinking and social research to address the complex issues of our time.More info: http://www.newschool.edu/"}, {"link": "https://www.mooc-list.com/university-entity/african-local-government-academy", "name": "African Local Government Academy", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-missouri-kansas-city", "name": "University of Missouri-Kansas City", "description": "The University of Kansas City was chartered in 1929, and one year later, Kansas City businessman and philanthropist William Volker donated 40.8 acres to the university. In 1931, Volker acquired and donated the Dickey mansion, which would house the first library, classrooms, cafeteria and administrative offices. UKC’s first classes began in 1933 with 17 instructors and 265 students enrolled. In 1936, 80 students became UKC’s first graduating class.With the founding of the university, UKC and Kansas City leaders wasted no time expanding, constructing three new buildings in three years. The first building constructed specifically for the university, Mannheim Hall, was built in 1935; Newcomb Hall came one year later, designed to be the school’s library. Haag Hall was built in 1937.Students also wasted no time forming their identity. In 1934, the student council named “old gold and royal blue” the official school colors. And, in 1937, Kasey the Kangaroo became UKC’s official mascot. Intercollegiate athletics and fraternities and sororities were approved by the trustees in 1954.Academics expanded, too, as UKC partnered with area schools to add more divisions, programs and majors. In 1938, Kansas City School of Law merged with UKC to form the Law School, and in 1941, the Kansas City-Western Dental College, founded in 1881, joined UKC. Today, UMKC School of Dentistry is the only dental school in the state of Missouri.The university's dedication to the arts was born in 1942, with the construction of the Fine Arts Center. The Kansas City Conservatory of Music joined UKC in 1959. In 1979, the James C. Olson Performing Arts Center was completed. Known as the “PAC,” it’s home to the UMKC Conservatory of Music and Dance and the Kansas City Repertory Theatre, helping UMKC become an integral part of Kansas City’s cultural character.One of the university’s most important moves came on July 25, 1963, when UKC became a part of the University of Missouri System. Progress continued to follow, including the construction of Katz Hall (1965), Miller Nichols Library (1965), Royall Hall (1968) and the Education Building (1969).The UMKC School of Medicine was founded in 1971, offering a unique and revolutionary six-year combined bachelor/M.D. program. Located on the Hospital Hill campus, the Medical School has now graduated over 3,000 M.D.s.More info: http://www.umkc.edu/"}, {"link": "https://www.mooc-list.com/university-entity/rice-university", "name": "Rice University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-college-london", "name": "University College London", "description": "UCL is one of the world's leading universities, founded in London to open up education to all on equal terms. Today our outstanding research and innovative teaching drive entrepreneurial solutions to the world's major problems.More info here."}, {"link": "https://www.mooc-list.com/university-entity/bcg-boston-consulting-group", "name": "BCG (Boston Consulting Group)", "description": "The Boston Consulting Group.More info here."}, {"link": "https://www.mooc-list.com/university-entity/moodle", "name": "Moodle", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/tel-aviv-university", "name": "Tel Aviv University", "description": "Tel Aviv University (TAU) - Israel's largest and most comprehensive institution of higher learning - is home to over 30,000 students studying in nine faculties and over 125 schools and departments across the spectrum of sciences, humanities and the arts.Situated in Israel's cultural, financial and technological capital, TAU shares Tel Aviv's unshakable spirit of openness and innovation – and boasts a campus life as dynamic and pluralistic as the metropolis itself. Tel Aviv the city and Tel Aviv the university are one and the same – a thriving Mediterranean center of diversity and discovery.More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-glasgow", "name": "University of Glasgow", "description": "Founded in 1451, the University of Glasgow is the fourth oldest university in the English-speaking world.Today we are a broad-based, research intensive institution with a global reach.More info: http://www.gla.ac.uk/"}, {"link": "https://www.mooc-list.com/university-entity/waves", "name": "Waves", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/california-institute-technology", "name": "California Institute of Technology", "description": "The California Institute of Technology (Caltech) is a world-renowned science and engineering research and education institution, where extraordinary faculty and students seek answers to complex questions, discover new knowledge, lead innovation, and transform our future. Caltech's mission is to expand human knowledge and benefit society through research integrated with education. We investigate the most challenging, fundamental problems in science and technology in a singularly collegial, interdisciplinary atmosphere, while educating outstanding students to become creative members of society.More info: http://www.caltech.edu"}, {"link": "https://www.mooc-list.com/university-entity/oklahoma-state-university", "name": "Oklahoma State University", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/yonsei-university", "name": "Yonsei University", "description": "Yonsei University was established in 1885 and is the oldest private university in Korea.Yonsei’s main campus is situated minutes away from the economic, political, and cultural centers of Seoul’s metropolitan downtown. Yonsei has 3,500 eminent faculty members who are conducting cutting-edge research across all academic disciplines. There are 18 graduate schools, 22 colleges and 133 subsidiary institutions hosting a selective pool of students from around the world.Yonsei is proud of its history and reputation as a leading institution of higher education and research in Asia.More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-reading", "name": "University of Reading", "description": "The University of Reading is ranked in the top 1% of universities in the world with a reputation for teaching, research and enterprise.The University aims to deliver a world-class experience to all of its learners. Teaching is research-led, so learners can benefit from the expertise and hands-on knowledge of teaching staff.The award-winning UK campuses in the south-east of England offer a fantastic environment in which to live and learn, with state-of-of-the-art facilities – all just 25 minutes from London.More info: http://www.reading.ac.uk/"}, {"link": "https://www.mooc-list.com/university-entity/national-geographic-society", "name": "National Geographic Society", "description": "The National Geographic Society is one of the world’s largest nonprofit scientific and educational organizations. Founded in 1888 to “increase and diffuse geographic knowledge,” the member-supported Society works to inspire people to care about the planet. National Geographic has funded more than 10,000 scientific research, conservation, and exploration projects and supports education programs that help students understand how our world works and how people, places, and environments interconnect.More info: http://education.nationalgeographic.com/education/?ar_a=1"}, {"link": "https://www.mooc-list.com/university-entity/harvardx", "name": "HarvardX", "description": "Some MOOCs and Free Online Courses from HarvardX are on the Harvard University page."}, {"link": "https://www.mooc-list.com/university-entity/hkustx", "name": "HKUSTx", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/michigan-state-university", "name": "Michigan State University", "description": "Spartans work every day to advance the common good in uncommon ways.Together, we tackle some of the world’s toughest problems to find solutions that make life better—from alternative energy to better food safety to breakthrough medical and environmental applications achieved through rare isotope research.We teach. We explore and we discover. We collaborate and lead. We innovate, inspire, and empower. We achieve our potential and create circumstances that help our students and others achieve theirs.We're good at it, and we've been at it for more than 150 years.The nation’s pioneer land-grant university, MSU began as a bold experiment that democratized higher education and helped bring science and innovation into everyday life. The revolutionary concept became a model for the nation.Today, MSU is one of the top research universities in the world—on one of the biggest, greenest campuses in the nation. Home to nationally ranked and recognized academic, residential college, and service-learning programs, we’re a diverse community of dedicated students and scholars, athletes and artists, scientists and leaders.In ways both practical and profound, we work to create a stronger, more sustainable, and more hopeful future for all.More info: http://www.msu.edu/"}, {"link": "https://www.mooc-list.com/university-entity/university-bath", "name": "University of Bath", "description": "The University of Bath is one of the UK's leading universities, ranked in the top ten of all national league tables.The University of Bath’s mission is to deliver world class research and teaching, educating its graduates to become future leaders and innovators, and benefiting the wider population through its research, enterprise and influence. University of Bath courses are innovative and interdisciplinary and have an outstanding record of graduate employment.More info: http://www.bath.ac.uk/"}, {"link": "https://www.mooc-list.com/university-entity/universidad-austral", "name": "Universidad Austral", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/mitx", "name": "MITx", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-queensland", "name": "University of Queensland", "description": "The University of Queensland, Australia, is one of the world’s premier teaching and research institutions. It is consistently ranked in the top 100 universities globally, has more areas of specialised research considered above world standard than any other Australian university and has won the most awards for university teaching in the country.Queensland's oldest university, UQ has produced more than 200,000 graduates. It currently has more than 45,000 students and 7,500 staff spanning six faculties and eight research institutes.More info here."}, {"link": "https://www.mooc-list.com/university-entity/universidad-blas-pascal", "name": "Universidad Blas Pascal", "description": "Desde sus inicios, la Universidad Blas Pascal se ha caracterizado por participar en la vida intelectual de la comunidad universitaria de Córdoba, abriendo espacios para la formación integral de la persona humana, la promoción de la innovación, la creatividad y la búsqueda de la excelencia académica en la educación impartida.La UBP tiene por finalidad la formación de graduados con un alto nivel de competencia profesional, tanto en el campo del conocimiento como en el de su aplicación instrumental (“Saber y Saber Hacer”). Se propone formar profesionales sólidos y creativos, capacitados para destacarse en un mundo crecientemente competitivo.More info: http://www.ubp.edu.ar/"}, {"link": "https://www.mooc-list.com/university-entity/universidad-del-norte", "name": "Universidad del Norte", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-birmingham", "name": "University of Birmingham", "description": "The University of Birmingham has been challenging and developing great minds for more than a century.Characterised by a tradition of innovation, research at the University has broken new ground, pushed forward the boundaries of knowledge and made an impact on people’s lives.The University continues this tradition today and has ambitions for a future that will embed its work and recognition of the Birmingham name on the international stage.Universities are never complete. They develop as new challenges and opportunities occur. At Birmingham the aim is to innovate and push the frontiers of understanding; it asks new research questions and turns theory through experiment into practice – because that’s what great universities do.More info: http://www.birmingham.ac.uk/index.aspx"}, {"link": "https://www.mooc-list.com/university-entity/ibm", "name": "IBM", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/nust-misis", "name": "NUST MISIS", "description": "NUST MISIS is one of the leaders of technological education in Russia. Founded in 1918, it is the country's leading university in the fields of materials science, metallurgy, mining, as well as it is actively strengthening its positions in the fields of biomaterials, nano- and IT technologies. Students from all Russian regions and from 69 countries study at NUST MISIS.NUST MISIS is a full-fledged research center and it has status of «National University of Science and Technology». 27 modern research laboratories and 3 innovative engineering centers operate at NUST MISIS. Among the NUST MISIS graduates and staff are the Nobel prizewinners and the USSR and the Russian Federation ministers; businessmen, included in the TOP-100 richest people in Russia; renowned film-directors, TV hosts, musicians, writers, and other presenters of art professions.NUST MISIS is one of the best universities in the world according to the Times Higher Education World University Rankings and the QS World University Rankings, and year by year it is strengthening its positions. In 2016, NUST MISIS was the only Russian university entering the Times Higher Education: World’s Best Small Universities Ranking. The ranking represents the world's best small 20 universities offering the wide range of subjects and qualitative educational programs.More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-maryland-university-college-umuc", "name": "University of Maryland University College (UMUC)", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/flinders-university", "name": "Flinders University", "description": "Flinders University enjoys a well-justified reputation for its excellence in teaching and research. It has a long-standing commitment to enhancing educational opportunities for all and a proud record of community engagement.More info: http://www.flinders.edu.au/"}, {"link": "https://www.mooc-list.com/university-entity/graduate-institute-international-and-development-studies", "name": "The Graduate Institute of International and Development Studies", "description": "The Graduate Institute of International and Development Studies is an institution of research and higher education dedicated to the study of world affairs, with a particular emphasis on the cross-cutting fields of international relations and development issues.Through its core activities, the Institute aims to promote international cooperation and make a contribution to the progress of developing societies. More broadly, it endeavours to develop creative thinking on the major challenges of our time, foster global responsibility and advance respect for diversity.The Graduate Institute is a cosmopolitan community located in the heart of Geneva, an international city and a centre of global governance. By intensely engaging with international organisations, NGO’s, governments and multinational companies, it participates in global discussions and prepares future policy-makers to lead tomorrow’s world.More info here."}, {"link": "https://www.mooc-list.com/university-entity/universit%C3%A9-de-bretagne-occidentale-ubo", "name": "Université de Bretagne Occidentale (UBO)", "description": "A public institution founded in 1971, UBO is a medium-sized university (around 18,000 students) offering a wide range of programs in all fields. It is a member of the Université Européenne de Bretagne (UEB), a regional coordination structure for higher education.Université de Bretagne Occidentale (UBO) is in Brittany, on the north-western coast of France. It is a multicampus university, with the main site in Brest and satellite campuses in Quimper and Morlaix.More info here."}, {"link": "https://www.mooc-list.com/university-entity/upvalenciax", "name": "UPValenciaX", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/emergency-planning-college-epc", "name": "Emergency Planning College (EPC)", "description": "The EPC is the UK’s national centre for resilience learning and development services; we develop people, teams and organisations through training, exercising and consultancy. We help customers protect their businesses and their reputation both in the UK and around the world.We have been sharing our experiences, expertise and knowledge for almost 80 years and every year over 7,000 people trust us to help them prepare for a wide range of disruptive events.We help organisations and individuals assess the risk of emergencies through planning to deal with them, developing the capability to deal with them effectively, responding to them and managing the recovery phase.The EPC is owned by the UK Government and, as part of the Cabinet Office’s Civil Contingencies Secretariat, our work is endorsed by the UK’s authority on resilience."}, {"link": "https://www.mooc-list.com/university-entity/foreducation", "name": "Foreducation", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/nc-state-university", "name": "NC State University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/spearhead-eduonline-pvt-ltd", "name": "Spearhead EduOnline Pvt Ltd", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/johns-hopkins-university", "name": "Johns Hopkins University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/ohio-state-university", "name": "The Ohio State University", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/tecnol%C3%B3gico-de-monterrey", "name": "Tecnológico de Monterrey", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/universidad-de-navarra", "name": "Universidad de Navarra", "description": "More info: http://www.unav.edu/"}, {"link": "https://www.mooc-list.com/university-entity/universit%C3%A9-virtuelle-environnement-et-d%C3%A9veloppement-uved", "name": "Université Virtuelle Environnement et Développement (UVED)", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/blended-schools", "name": "Blended Schools", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/institute-emerging-issues", "name": "Institute for Emerging Issues", "description": "The Institute for Emerging Issues brings people together around complex issues in pursuit of a single goal: to ensure North Carolina’s future competitiveness. IEI is a different kind of public policy organization. We believe when people work together with a shared will and common vision, progress is smarter, more comprehensive, and enduring.That’s why we engage people from all regions, all sectors, and all points of view.More info: http://iei.ncsu.edu"}, {"link": "https://www.mooc-list.com/university-entity/tokyo-institute-technology", "name": "Tokyo Institute of Technology", "description": "Tokyo Institute of Technology (Tokyo Tech) is the top research-based national university in Japan dedicated to science and engineering higher education with a history spanning over 130 years. Tokyo Tech consists of undergraduate and graduate programs, and many research laboratories spread over its three campuses in Tokyo and Yokohama. There are approximately 10,000 students of which 12% are international, 1,200 faculty and 600 staff members on its campuses. Tokyo Tech strives to cultivate its students to become tomorrow's global leaders in science and technology in order to contribute to the betterment of a global society based upon a philosophy of education through research.As part of an institute-wide reorganization and education reform effort to become one of the world’s top sci-tech universities, TokyoTechX courses will be offered starting in 2015, to demonstrate its commitment to global higher education.More info here."}, {"link": "https://www.mooc-list.com/university-entity/ensae-ecole-nationale-de-la-statistique-et-de-ladministration-economique", "name": "ENSAE ( Ecole Nationale de la Statistique et de l'Administration Economique)", "description": "L'ENSAE ParisTech est la seule grande école d’ingénieur spécialisée en économie, statistique, finance et actuariat. L’école et le centre de recherche qui lui est associé, le CREST (Centre de recherche en économie et statistique) forment un pôle d’enseignement supérieur et de recherche de premier plan qui fait partie du GENES (Groupe des écoles nationales d’économie et statistique). L’école est par ailleurs membre du réseau ParisTech.L’ENSAE ParisTech est ainsi membre fondateur de la fondation de coopération scientifique (FCS) du Campus Paris-Saclay. L’école et le centre de recherche devraient déménager dans un nouveau bâtiment à construire sur le plateau de Saclay à l’horizon de 2016. ; au sein de la future « Université Paris-Saclay », l’ENSAE ParisTech a vocation à jouer, au côté de ses partenaires, un rôle pivot dans la structuration du domaine « économie, statistique et sciences sociales ».Pour l’ENSAE ParisTech les enjeux d’une offre MOOC sont les suivants :- Tester et comprendre la technologie, l’impact, la certification, le modèle économique- Promouvoir nos cursus- Appuyer nos objectifs de politique publique : transfert de connaissance (y compris vers d’autres pays francophones), vitrine éducative (au-delà de nos cursus, promouvoir l’enseignement supérieur)Pour tester et comprendre nous menons actuellement un premier test, sur le cours de « Modèles de durée », essentiel dans notre cursus. Ce cours est d’une part proposé en MOOC « hybride » à nos élèves, c’est-à-dire que le cours magistral est remplacé par le MOOC et complété par des séances de travaux dirigés. Il sera d’autre part proposé seul sur la plateforme FUN à la fin du semestre, après le bilan fait avec les étudiants et lorsque quelques compléments seront apportés (sous-titres anglais, matériel pédagogique, quizz).Pour l’avenir nous envisageons de tester la certification (par exemple en proposant aux étudiants qui le souhaitent de passer un examen contre rémunération, examen dont la forme serait à définir).D’autres cours devraient suivre ce premier essai, les pistes envisagées étant- Une mise à niveau des candidats aux Mastères Spécialisés- Des Certificats de formation continue partiellement en MOOC- D’autres cours du cursus ingénieur en MOOCMore info here."}, {"link": "https://www.mooc-list.com/university-entity/ojai-music-festival", "name": "Ojai Music Festival", "description": "For nearly 70 years, the Ojai Music Festival has been a laboratory for the special chemistry that results from combining insatiable curiosity with unbounded creativity. The formula is simple: Each year a music director is given the freedom and resources to imagine four days of musical brainstorming. Some have approached their task with caution, fearing that Ojai might be like other places. But, of course, it’s not. More often this unique blend of enchanted setting and an audience voracious in its appetite for challenge and discovery has inspired a distinguished series of conductors, performers, composers to push at boundaries and stretch limits.More info here."}, {"link": "https://www.mooc-list.com/university-entity/politecnico-di-milano", "name": "Politecnico di Milano", "description": "More info: http://www.polimi.it/en/"}, {"link": "https://www.mooc-list.com/university-entity/charite-universitatsmedizin-berlin", "name": "Charité – Universitätsmedizin Berlin", "description": "Charité is one of the largest university hospitals in Europe. All of our clinical care, research and teaching is delivered by physicians and researchers of the highest international standard. Charité proudly lays claim to more than half of all German Nobel Prize winners in Physiology or Medicine, including Emil von Behring, Robert Koch, and Paul Ehrlich. Charité is internationally renowned for its excellence in teaching and training. Charité – Universitätsmedizin Berlin represents a single medical faculty, which serves both Humboldt Universtität zu Berlin and Freie Universität Berlin. Charité extends over four campuses, and has close to 100 different Departments and Institutes, which make up a total of 17 different CharitéCenters. Having marked its 300-year anniversary in 2010, Charité is now one of the largest employers in Berlin, employing 13,370 staff (or 17,500 if including its subsidiaries), and with a total annual turnover of €1.6 billion."}, {"link": "https://www.mooc-list.com/university-entity/universidad-autonoma-de-madrid", "name": "Universidad Autonoma de Madrid", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-torontox", "name": "University of TorontoX", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/culturelink", "name": "CultureLink", "description": "CultureLink is a non-profit organization located in Toronto, Canada with 27 years of experience developing and delivering settlement services to facilitate new immigrants' integration into Canada diverse communities. We specialize in orienting newcomers, helping them find Canadian mentors, employment and other resources.More info here."}, {"link": "https://www.mooc-list.com/university-entity/tumx", "name": "TUMx", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/indian-institute-management-bangalore", "name": "Indian Institute of Management, Bangalore", "description": "Established in 1973, the Indian Institute of Management, Bangalore is one of the top management schools in India. We build leaders through holistic, transformative and innovative education.We are known for excellence in both teaching and research, and our alumni are leaders in business, government and civil society across the globe. We collaborate with over a hundred leading management schools in several countries on research initiatives and student and faculty exchange programs. The Financial Times has rated our doctoral program in the top fifty globally. Eduniversal, Paris, has ranked us the best business school in Central Asia.More info here."}, {"link": "https://www.mooc-list.com/university-entity/universidad-de-murcia", "name": "Universidad de Murcia", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/alison", "name": "ALISON", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/relay-graduate-school-education", "name": "Relay Graduate School of Education", "description": "Relay Graduate School of Education is a ground-breaking, nonprofit graduate school with an innovative Master's degree program designed specifically to respond to today's urgent demand for effective and successful teachers.More info: http://www.relay.edu/"}, {"link": "https://www.mooc-list.com/university-entity/british-council", "name": "British Council", "description": "The British Council creates international opportunities for the people of the UK and other countries and builds trust worldwide.The British Council is on the ground in six continents and over 100 countries bringing international opportunity to life, every day. Each year their teams work with millions of people, connecting them with the United Kingdom, sharing cultures and the UK’s most attractive assets: English, the Arts, Education and its ways of living and organising society. The British Council has over 75 years’ experience of doing this.In line with its Royal Charter, the British Council aims to bring high quality English materials to every learner or teacher who wants them around the world. It works with governments to transform whole education systems to increase opportunity and employability through English. It also delivers English teaching and trains teachers by radio, web and broadcast in developing and post conflict countries.In the Arts the British Council works with the best of British and international artistic and creative talent to develop events and collaborations which link thousands of artists, organisations and audiences worldwide. In addition to staging shows and exhibitions, it partners with others on joint Arts projects and helps develop creative leadership, professional networks and cultural educational programmes worldwide.All over the world, people want greater educational opportunities to enhance their lives and employment prospects. The British Council’s focus in education is on bringing an international dimension to education in schools, technical colleges and universities, on raising educational standards by sharing the UK’s expertise, and on encouraging the best international students to study in the UK.The British Council’s high profile work in English, the Arts and Education & Society helps hundreds of millions of people worldwide to learn about and experience creativity and excellence from the UK. Millions of talented people of all ages – but particularly younger people – engage face-to-face and online learning English, developing new skills, experiencing life and study in the UK and earning UK qualifications.Finally, thousands of policymakers, academics, researchers, artists, sportspeople, scientists, curators, creative entrepreneurs, head- and classroom teachers work through the British Council with their counterparts in the UK to develop policy, professional standards and participation in English, the Arts, Education and civil society. In the process, they create new opportunities and possibilities for the UK and their own countries.By teaching English, changing the way we see each other through the Arts, offering international education opportunities and sharing the UK’s ways of living and organising our society the British Council creates opportunity, trust, prosperity and security for the people of the UK and the many other countries it works in around the world.More info: http://www.britishcouncil.org/"}, {"link": "https://www.mooc-list.com/university-entity/saylororg", "name": "Saylor.org", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/university-southampton", "name": "University of Southampton", "description": "The University of Southampton is already one of the top 15 research universities in the UK and has achieved consistently high scores for its teaching and learning activities.Southampton is a place for ambitious people keen to stretch their intellectual abilities and help change the world.From the birthplace of the technologies which drive the Internet to ground-breaking medical breakthroughs in conditions such as cancer, Alzheimer’s and asthma, the University of Southampton has spent the last 60 years changing the world.Ranked among the top 100 in the world, Southampton is a forward-thinking university that works at the cutting-edge of research, bringing a positive impact to global societies in a wide range of areas such as computer science, oceanography, sustainable energy, engineering and medicine.The University has thousands of academics and staff working to unlock the potential and support the ambition of more than 22,000 students and an exciting new community of learners from around the world studying its sector-leading MOOCs.The students themselves are also working to change the world from projects in Africa, which are raising living standards through micro finance, to providing donated ambulances for emergency services in Mongolia, helping to save countless lives.More info: http://www.southampton.ac.uk"}, {"link": "https://www.mooc-list.com/university-entity/university-college-denmark", "name": "University College, Denmark", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-tennessee", "name": "The University of Tennessee", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/learn-comau", "name": "learn .com.au", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-texas-austin", "name": "University of Texas at Austin", "description": "The University of Texas at Austin is the top-ranked public university in a nearly 1,000-mile radius, and is ranked in the top 25 universities in the world. Students have been finding their passion in life at UT Austin for more than 130 years, and it has been a member of the prestigious AAU since 1929. UT Austin combines the academic depth and breadth of a world research institute (regularly ranking within the top three producers of doctoral degrees in the country) with the fun and excitement of a big-time collegiate experience. It is currently the fifth-largest university in America, with more than 50,000 students and 3,000 professors across 17 colleges and schools. UT Austin will be opening the Dell Medical School in 2016."}, {"link": "https://www.mooc-list.com/university-entity/iversity", "name": "iversity", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/delft-university-technology", "name": "Delft University of Technology", "description": "Delft University of Technology is the largest and oldest technological university in the Netherlands. Our research is inspired by the desire to increase fundamental understanding, as well as by societal challenges. We encourage our students to be independent thinkers so they will become engineers capable of solving complex problems. Our students have chosen Delft University of Technology because of our reputation for quality education and research.More info here."}, {"link": "https://www.mooc-list.com/university-entity/canvas-network", "name": "Canvas Network", "description": ""}, {"link": "https://www.mooc-list.com/university-entity/leada-inc", "name": "Leada, Inc", "description": "More info here."}, {"link": "https://www.mooc-list.com/university-entity/university-kaiserslautern-tuk", "name": "University of Kaiserslautern (TUK)", "description": "More info here."}]